[
  {
    "slug": "atlantic-canada-ai-summit-youth-ai-pitch-2025",
    "meta": {
      "title": "Bay View High at Atlantic Canada AI Summit: Lessons in AI and Collaboration",
      "description": "My experiences in developing IWKids and competing at the Youth AI Pitch Competition with the Bay View High School Tech Club, exploring how AI can make a real difference in our community!",
      "date": "September 1, 2025",
      "keywords": [
        "Aayush Sood",
        "Youth AI Pitch Competition",
        "Atlantic Canada AI Summit",
        "IWKids app",
        "Student AI challenge",
        "Bay View High School Tech Club",
        "STEM student projects",
        "AI prototyping for kids’ ER",
        "IWK Hospital innovation",
        "Saint Mary's University AI event",
        "“AI healthcare innovation”",
        "“student pitch competition”",
        "“emergency room AI app”"
      ]
    },
    "content": "\r\n![Youth AI Pitch Competition Banner](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/competition-banner.webp)\r\n\r\nAfter winning the [Lockheed Martin CYBERQUEST Competition](/blog/lockheed-martin-cyberquest-2025), our [Bay View High School Tech Club](https://bvh-tech-club.netlify.app/) turned its attention to a new challenge, one that aimed to tackle a real problem affecting our community.\r\n\r\nThe [Atlantic Canada AI Summit](https://www.smu.ca/ai-summit/index.html), hosted at [Saint Mary's University](https://www.smu.ca/) (SMU) in May 2025, aimed to showcase cutting-edge AI research, facilitate industry-academia collaboration, and highlight exceptional AI talent in the region. One of their programs featured was the [Youth AI Pitch Competition](https://www.smu.ca/ai-summit/may3.html), which tasked middle and high school teams to come up with innovative AI-driven solutions to enhance the Emergency Room experience for kids and their families at the [IWK Hospital](https://iwkhealth.ca/). The competition consisted of Generative AI workshops facilitated by SMU Master of Business Analytics students, with the contest commencing later in the afternoon.\r\n\r\nSimilar to CYBERQUEST, each team consisted of 3-5 members. I spread the word to Tech Club members and quickly found interested participants. Our team consisted of me, Seth, Yaya, and Baruch. Our team was assembled at the beginning of April, giving us about three weeks to create a prototype and pitch for the May 3 competition.\r\n\r\nUnlike CYBERQUEST, we now had to create a semi-functional product addressing a real community problem, rather than practicing hacking techniques.\r\n\r\nWe then began our research on problems that affect the Emergency Room and their potential solutions.\r\n\r\n# Planning\r\n\r\n![Youth AI Pitch Competition Banner](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/emergency-room.webp)\r\n\r\nWhen conducting our research on how we can improve the Emergency Room experience, we identified five main problems that cause stress for children and their parents:\r\n\r\n- Long wait times\r\n- Confusing procedures\r\n- Overwhelmed parents\r\n- Busy staff can't give 1:1 attention\r\n- Kids pick up on adult emotions, stressed parents result in overwhelmed kids\r\n\r\nWe had identified problems that affect the Emergency Room but weren't sure what a potential solution would look like, so I hosted a Tech Club workshop focused on finding a solution for this competition.\r\n\r\nDuring the workshop, I organized our members in groups, similar to the competition, and tasked them with proposing a concept of what a solution for these problems could look like. I gave them 30 minutes to develop an idea, then 15 minutes to pitch it to the rest of the club.\r\n\r\nMany ideas were proposed, such as:\r\n\r\n- An AI chatbot\r\n- Games for children\r\n- Feedback system for hospital staff\r\n- Virtual calls with doctors\r\n\r\nAlthough the ideas were very different, they all used one medium: mobile devices.\r\n\r\nIt made sense, the majority of the population today have mobile devices, and if we can make the Emergency Room experience easier for families through these devices, it would be really beneficial for the community.\r\n\r\nSince the app was designed to enhance the IWK Emergency Room experience for children and families, we named it **IWKids.**\r\n\r\nWe came up with reasons why the app would benefit all stakeholders:\r\n\r\n- Kids are calmer, engaged, and less stressed.\r\n- Parents feel reassured, supported, and well-informed.\r\n- Emergency Room Staff can focus more on clinical care.\r\n- Reduced Emergency Room traffic due to self-diagnostic features.\r\n- Increased system efficiencies due to integration with provincial systems.\r\n- Overall better healthcare experience for all stakeholders.\r\n\r\nAs the Technical Lead of the team, I began developing a mobile app that combined all of these ideas together.\r\n\r\n# Prototyping\r\n\r\n![IWKids Thumbnail](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/iwkids-thumbnail.webp)\r\n\r\nI decided on creating a [React Native](https://reactnative.dev/) (a tool for creating mobile apps for iOS and Android) app powered by [Expo](https://expo.dev/) (a tool that eases the process of creating mobile apps). For integrating an AI chatbot in the app, I used [OpenAI's](https://openai.com/) APIs (a platform for creating AI-powered applications) to power a medical diagnostic platform capable of providing preliminary diagnoses, as well as [Twilio](https://www.twilio.com/) (a platform for sending SMS messages and notifications) to enable the transmission of SMS text messages for communication and notifications to families.\r\n\r\nWhen approaching the overall design of the app, I made sure it was consistent with the IWK brand. IWK has a [branding guide](https://www.iwk.nshealth.ca/logo/logo-files/IWK-Brand-Identity-Guide-2020-v15.pdf), which I used to find their typography, colors, logo, and used them throughout the app.\r\n\r\n![IWKids Home Screen](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/iwkids-home-screen.webp)\r\n\r\nI designed a simple home page with a column of buttons leading to other sections of the app, keeping navigation straightforward for a critical system like this.\r\n\r\nThe chatbot was one of the most essential screens on the app, as it pre-diagnosed potential patients before they stepped inside the hospital. If the chatbot believes that your condition was serious, it would advise you to check into IWK. The AI model was programmed with this prompt:\r\n\r\n\"_ChatGPT should act like a medical assistant in a children's hospital. It should talk in a friendly, comforting tone and keep responses brief. It should diagnose medical conditions and determine and recommend if people need to go to the Emergency Room or explore other options._\"\r\n\r\nThis prompt allowed the chatbot to approach patients' issues with the right attitude and tone, especially in dire situations that cause stress and anxiety. In the real-world, we theorized that a medical AI model that is vetted by the IWK Hospital would be used instead of a standard ChatGPT model.\r\n\r\nI worked on the check-in mechanism, where you provide your name and phone number and are immediately put into a queue. Your place in the queue would be communicated to your phone number via SMS transmission. After checking in, users could view hospital wait times, which would be connected to hospital databases in a production environment.\r\n\r\nI developed a feedback mechanism after a patient's consultation finishes, where they simply provide a smiley or frowny face along with a description.\r\n\r\nOther smaller features included games for children, quick links to useful resources, and a map of IWK.\r\n\r\nIf you're interested in exploring the code behind IWKids, we've made the project available on [GitHub](https://github.com/soodaayush/IWKids). Feel free to check it out!\r\n\r\nThe flowchart below describes the simplified Emergency Room journey of a patient:\r\n\r\n![ER Journey](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/er-journey.webp)\r\n\r\nAlong with the prototype, we developed a slideshow outlining our pitch, making us ready for the big day that lay ahead.\r\n\r\n# Competition Day\r\n\r\n![Sobey School of Business](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/sobey-school-of-business.webp)\r\n\r\nThe big day arrived, and we were all ready to enter the halls of the Sobey School of Business, where we were promptly registered.\r\n\r\nWhen we entered the lecture hall, we saw about 20 other teams; clearly, many students around Halifax were passionate about tackling the same challenges.\r\n\r\nWe started the morning with snacks and presentations on how AI can be used to push false narratives, biases in AI, and how AI can be used to make our lives easier through various tools such as:\r\n\r\n- [Krea](https://www.krea.ai/) - uses AI to generate and edit images, videos, and animations.\r\n- [Perplexity Pages](https://www.perplexity.ai/hub/blog/perplexity-pages) - lets users transform research and search results into structured, visually-rich articles and reports.\r\n- [Cursor IDE](https://cursor.com/) - an AI-powered code editor.\r\n\r\nThe organizers initiated an activity where we were to form larger groups and describe a positive usage of AI. Each group is to pitch to organizers and their fellow peers, serving as a warm-up to the eventual competition.\r\n\r\n![Positive AI Usage Pitch](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/positive-ai-usage-pitch.webp)\r\n\r\nOur group presented an AI news reporter that will keep tabs on world events 24/7.\r\n\r\nFollowing the informative presentations, we were given some time to iterate on our prototypes and pitches.\r\n\r\n![Team Iterating Pitch](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-iterating-pitch.webp)\r\n\r\nThe structure of the competition was explained to us:\r\n\r\n- There are qualifying rounds, where 3-4 teams are sent to rooms around the building to pitch their ideas for a maximum of five minutes to SMU professors.\r\n- Eight teams who qualified will be sent to the conference room to pitch their ideas in front of a panel of judges along with an audience consisting of families and professionals.\r\n- The top 3 teams win a cash prize.\r\n\r\nAt lunch, we visited sponsor booths and spoke with companies such as [CGI](https://www.cgi.com/canada/), [Ernst & Young](https://www.ey.com/), and representatives from SMU about their visions for AI.\r\n\r\nAs our team was escorted our room, we immediately started adding features to our app and refining our pitch. Teams were provided advisors, mostly SMU Business students, who would make recommendation on what to include/exclude from our prototypes and pitches. The advisors were very impressed with our product and pitch and were anticipating a potential podium finish.\r\n\r\nDuring the hour, I quickly built a Tic-tac-toe game to demonstrate how children's games could be integrated into the app.\r\n\r\nWe planned our pitch to be 2 minutes of explaining the problems in the Emergency Room, covered by Baruch, Yaya, and Seth, following up with me leading a demo of the mobile app.\r\n\r\n![Team Presenting Qualifying Pitch](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/qualifier-pitching.webp)\r\n\r\nWe commenced our qualifying pitch for IWKids, and I thought at the time that we did well despite many areas for improvement. The judges were very impressed with the Tic-tac-toe game I hastily put together in a matter of 20 minutes.\r\n\r\nWe watched the other teams pitch their ambitious ideas, and we didn't know if we would qualify. Following the presentations, all teams were sent to the conference room, where the organizers would announce the teams that would advance forward to present their ideas to the judges.\r\n\r\n![Team Sitting](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-sitting.webp)\r\n\r\nWhile sitting, we were eagerly awaiting the results. After some 30 minutes of silence, the organizers began to read the teams who succeeded from each room.\r\n\r\nWe heard our team's name and immediately began celebrating. We weren't done yet, but we were one more step closer to potentially placing well at this competition.\r\n\r\nThe competition officially began, and we were the third team to present.\r\n\r\nIt was our turn to pitch our idea, and we walked onto the stage in front of a panel of judges and a large audience. We were all nervous being up there, but we believed in our idea and product, which eased our fears.\r\n\r\n![Team Pitching](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-pitching.webp)\r\n\r\nSimilar to the qualifying round, Baruch, Seth, and Yaya explained the problems we were tackling and how our app helps all stakeholders, following up with me demoing the mobile app.\r\n\r\n![Team Demo](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-demo.webp)\r\n\r\nDuring my demo, I emphasized the chatbot along with our SMS integration. To make the judges extremely aware of SMS, we placed a phone at the table in front of them, and thankfully, our demo worked as the device successfully received its message. At the end, we all felt pretty good about the presentation.\r\n\r\nThe other teams finished presenting, and we waited anxiously for the results. We were told to hold back for some time as the judges would deliberate on the winners.\r\n\r\nOur team decided to discuss with other groups regarding their performances and products, as every single group proposed very creative ideas that can genuinely benefit the lives of people in our communities.\r\n\r\nWe were then asked to be seated as the judges were about to unveil the winners of this competition.\r\n\r\nThe judges acknowledged that all pitches were excellent and innovative, making it a hard decision for them to decide the top three winners.\r\n\r\nThey began to announce winners. Third place was announced and it wasn't our group, we were confused as to if this was a positive or negative sign. They announced second place, which was a mobile app that aimed to ease the Emergency Room experience for both patients and IWK staff, and we knew then that we had [achieved](https://www.instagram.com/p/DJNVjHVSZC3/) second place.\r\n\r\nOur group name was announced, and we were all ecstatic to earn our second podium finish in just a month, right after CYBERQUEST, and we won a $500 cheque and a certificate!\r\n\r\n![Team Holding Cheque](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-holding-cheque.webp)\r\n\r\nThere was a ceremony for the winners, where we were all on the stage holding our cheques and getting our photos taken. We were very thrilled to have earned this distinction, as we poured several hours into planning, prototyping, and executing our pitches.\r\n\r\n# Future Possibilities\r\n\r\n![Future Possibilities](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/future-possibilities.webp)\r\n\r\nThere were several features we had in mind regarding the future of this app, ranging from small quality-of-life features such as live wait times to larger integrations such as Digital Twins. I'll discuss a couple of the main features we wanted to see.\r\n\r\nA [digital twin](https://en.wikipedia.org/wiki/Digital_twin) is the most interesting out of the seven features. It essentially is a virtual copy of a real object, system, or process that mirrors its behavior, allowing you to monitor, test, and improve it safely in a digital space. In this context, the digital twin would be the interior and exterior of the IWK Hospital, which can allow staff to improve processes.\r\n\r\nHealth Tracking is another feature that has been implemented in other apps, but would be different with IWKids. [Nova Scotia Health](https://www.nshealth.ca/) is currently working on [One Person One Record (OPOR)](https://physicians.nshealth.ca/topics/nova-scotia-provider-digital-health-toolkit/one-person-one-record-opor), a digital health system that brings all patient information into all unified record, helping providers deliver safer, faster, and more coordinated care. An integration of OPOR with IWKids would be revolutionary as health data in Nova Scotia is mostly kept on paper.\r\n\r\n# Takeaways & Impact\r\n\r\n![Team Photo](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-photo.webp)\r\n\r\nThis was our first pitch competition, and it taught me a lot about presenting ideas clearly and working collaboratively under pressure. I gained creative problem-solving skills and learned how to clearly present technical ideas to a broader audience.\r\n\r\nThe experience also made AI tangible. Instead of seeing it as abstract algorithms behind the scenes, I saw how it can be applied to solve real problems in our community. Working with my team, we brainstormed, prototyped, and turned an idea into a project we were truly proud of.\r\n\r\nThis project wasn't just a school assignment, it showed me how AI, technology, and teamwork can create real impact. It also proved you don't need to be an expert; curiosity, collaboration, and asking the right questions are enough to make a difference.\r\n\r\nThe competition may be running again next year, and I hope to see Tech Club compete to further contribute to our community! Looking ahead, I'm eager to keep seeking challenges where we push ourselves, learn new skills, and use technology to make a difference.\r\n"
  },
  {
    "slug": "lockheed-martin-cyberquest-2025",
    "meta": {
      "title": "Bay View High at CYBERQUEST 2025: Lessons in Cybersecurity and Teamwork",
      "description": "My experiences in preparing and competing at the Lockheed Martin CYBERQUEST Competition alongside the Bay View High School Tech Club!",
      "date": "August 23, 2025",
      "keywords": [
        "Aayush Sood",
        "Lockheed Martin CyberQuest",
        "Cybersecurity competition",
        "High school CTF",
        "Student cybersecurity challenge",
        "Bay View High School Tech Club"
      ]
    },
    "content": "\r\n![Lockheed Martin Logo](/assets/blog/lockheed-martin-cyberquest-competition-2025/lockheed-martin-logo.webp)\r\n\r\nWhen our [Tech Club](https://bvh-tech-club.netlify.app/) first heard about a chance to compete in a real cybersecurity competition, we never imagined ourselves racing against other schools in a high-stakes hacking challenge. The [Lockheed Martin CYBERQUEST Competition](https://www.lockheedmartin.com/en-us/who-we-are/communities/cyber-quest.html), held in-person across Canada, the U.S., and Australia, is an annual cybersecurity event for high school students. The nearest Lockheed Martin office from our school was just a short distance away in Dartmouth, Nova Scotia.\r\n\r\nThe competition consisted of Capture the Flag (CTF) challenges, which are exercises that involve finding a specific text string within a given problem. For example, a problem may involve investigating a website's source code to find a specific string, such as Y0U_F01ND_M3. Teams that gain the most points out of solving multiple of these challenges in the three-hour competition win 1st place, while others place in the top 3.\r\n\r\nEach high school team consisted of 3-5 members, so we decided on bringing four other passionate Tech Club members and myself to this competition. Categories of challenges spanned from web-based attacks, Cryptography, Social Engineering, and more. Our team was not fully aware of these concepts, so we spent the next few weeks preparing for the competition, which will be hosted in the Dartmouth office on March 29, 2025. We registered our team as Bay View High School SharkBytes.\r\n\r\nWe knew we had a lot to learn before the big day, so we dove into weeks of preparation.\r\n\r\n# Preparation\r\n\r\n![PicoCTF](/assets/blog/lockheed-martin-cyberquest-competition-2025/picoctf.webp)\r\n\r\nOur team wasn't quite sure how to prepare for such an event, especially when it was our first time learning about the broad field of cybersecurity. We eventually stumbled on a platform that prepares you for CTF competitions, called [PicoCTF](https://picoctf.org/). PicoCTF offered problems of varied difficulty and a broad selection of categories, which was perfect for preparing for the competition.\r\n\r\nOur team tried to solve one challenge a day leading up to the competition. We made it an essential objective to especially focus on problems that involve technical areas that we were unfamiliar with, so we can expand our skillsets while focusing less on what we already knew.\r\n\r\nI led a [workshop](https://www.instagram.com/p/DGKInY3se8Y/) for all Tech Club members on PicoCTF and how CTF challenges work, as I found it to be the perfect time to introduce cybersecurity as a career possibility for all Tech Club members.\r\n\r\n![Tech Club Cybersecurity Workshop](/assets/blog/lockheed-martin-cyberquest-competition-2025/cybersecurity-workshop.webp)\r\n\r\nWant to see more of our club's activities, projects, and updates? Follow us on Instagram at [@bvhstechclub](https://www.instagram.com/bvhstechclub/) to stay connected and support our cause!\r\n\r\n# Competition day\r\n\r\n![Lockheed Martin Dartmouth](/assets/blog/lockheed-martin-cyberquest-competition-2025/lockheed-martin-dartmouth.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-Mk4M2BC/A)_\r\n\r\nThe day of the competition rolled around, and we were all excited to enter the office of Lockheed Martin and learn the art of cybersecurity. We entered an area of the building and encountered other teams there from high schools around Halifax. The rules of the competition were explained to us. Here's a quick summary:\r\n\r\n- Challenges ranged in difficulty and point value.\r\n- Teams could spend points for hints.\r\n- Web usage was allowed, except for posting on forums to find answers.\r\n- Generative AI was also allowed, but copying and pasting the challenge prompt into the AI was not allowed.\r\n\r\nThe competition commenced and we got straight to cracking the various cybersecurity problems presented to us.\r\n\r\n![SharkBytes in Competition](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-competing.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-4RZPmtN/A)_\r\n\r\nWe tackled problems concerning Forensics, General Trivia Questions, Operating Systems, and more. Our team worked well, as each of us tackled a separate problem in an effort to gain the most points possible. We decided to tackle the easier, low-point problems first to accumulate points quickly, then moved on to the harder problems. I personally tackled packet analysis through Wireshark, phishing, and web-based problems.\r\n\r\nIt was very competitive, as all three teams were at one point leading one another, but only ever so slightly. There were moments when just one problem made the difference between first and third place. At one point, all five of us came together to tackle a set of tricky trivia questions. We struggled at first, but the solution only emerged after everyone threw in their ideas. That moment was a reminder that the best breakthroughs come from teamwork, not individual effort. The competition felt tense yet very friendly, with all the participants typing away at their computers.\r\n\r\nAfter a very close competition, our team was thrilled to earn third place. We celebrated our achievement with a pizza party, proudly received medals and a trophy, and enjoyed the moment together.\r\n\r\n![SharkBytes Team Picture](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-team-picture.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-bv83stV/A)_\r\n\r\n# Takeaways\r\n\r\nThis competition taught us a variety of tools and techniques. We learned tools such as\r\n\r\n- [Wireshark](https://www.wireshark.org/) - lets you see and analyze the data moving across a network.\r\n- [Burp Suite](https://portswigger.net/burp) - A toolkit for finding security flaws in websites.\r\n- [CyberChef](https://gchq.github.io/CyberChef/) - nicknamed the \"cyber Swiss Army knife,\" it helps decode and transform encrypted text or data.\r\n- [Metasploit](https://www.metasploit.com/) - A framework for safely testing vulnerabilities in systems to understand how attackers might break in.\r\n- [Kali Linux](https://www.kali.org/) - A special operating system loaded with cybersecurity tools used by professionals.\r\n\r\nDue to this being our first team competition, I learned many soft skills, such as leadership, communication, and delegating tasks to my team in real time during a contentious competition such as this.\r\n\r\n# Impact and What's Next\r\n\r\n![SharkBytes Team Picture](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-posing.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-5BpxkLB/A)_\r\n\r\nThis experience reshaped how I see cybersecurity. Before CyberQuest, I thought of it as a niche field for experts. Now, I realize it touches everything, from protecting personal data on social media to safeguarding national infrastructure.\r\n\r\nWith businesses, governments, and even schools relying so heavily on technology, the need for cybersecurity professionals is only going to grow.\r\n\r\nFor me, what started as a school competition has now sparked a genuine interest in a career path that impacts almost every part of modern life.\r\n\r\nIf you've ever been curious about cybersecurity, even if it seems intimidating, dive in. Competitions like CyberQuest prove that with teamwork, creativity, and persistence, anyone can start building these skills. You don't need to be an expert; you just need curiosity and a willingness to learn.\r\n\r\nFor us, what began as a club project turned into an unforgettable experience, and possibly even a career path. Who knows? You first challenge might spark the same for you.\r\n\r\nLooking ahead, I'm excited to continue this journey with my team as we set our sights on the [CyberPatriot National Youth Cyber Defense Competition](https://www.uscyberpatriot.org/), another incredible opportunity to put our skills to the test and grow together as cybersecurity defenders!\r\n"
  },
  {
    "slug": "new-website",
    "meta": {
      "title": "New Website!",
      "description": "This is my first ever blog post! I will be going into the new website, why I built it, the tech stacked used, updates, additions, and the trials and tribulations faced along the journey!",
      "date": "March 15, 2025",
      "keywords": [
        "Aayush Sood"
      ]
    },
    "content": "\r\n![New Website](/assets/blog/new-website/new-website.webp)\r\n\r\nHello World! This may seem new to you, but I now have a website that represents who I am and my interests in an organized manner. I will be going into why I decided to make an entirely new website from scratch, what tools I used, updates & additions, and the trials and tribulations faced during the journey.\r\n\r\n# The Old Website\r\n\r\n![Old Website](/assets/blog/new-website/old-website.webp)\r\n\r\nI had developed the [first iteration](https://portfolio-website-4v4.pages.dev/) of my personal portfolio during the winter break of 2023. It served as a good showcase of my skills and projects at the time, but I had felt that the interface was not as appealing, and that there could have been more information present. I was thinking of updating the original website itself, but found that since I had developed it in basic HTML, CSS, and JavaScript, that it would become tedious to implement complex features such as a blog. I had decided on creating a new website that uses an actual frontend framework to simplify the process of building and adding onto it.\r\n\r\n# Tech Stack\r\n\r\n![Projects Section](/assets/blog/new-website/tech-stack.webp)\r\n\r\nFor this website, I had decided to use the [Next.js](https://nextjs.org/) framework, which is powered by [React.js](https://react.dev/). I had decided on choosing Next.js due to its widely known performance metrics and its SEO optimizations. For all animations on this website, the [Motion](https://motion.dev/) package was used as it provided a simple and seamless experience when creating them. The [React-Icons](https://react-icons.github.io/react-icons/) package was used in a few places on this website, mainly in the Interests section on the Home page and the mobile header. [MDX](https://mdxjs.com/) was used to make it easier for me to write blogs as I was already familiar with Markdown. I use [Cloudflare](https://www.cloudflare.com/) to host this website, as it provides real-time analytics along with DDoS protection.\r\n\r\n# Updates\r\n\r\nMost of the updates made on this new iteration mostly concern the home page. I reworked the entire projects section to be a carousel that is guided by you, the user. This way, the section does not take up as much space as the first iteration did, which is essential when adding more projects to the list.\r\n\r\n![Projects Section](/assets/blog/new-website/projects.webp)\r\n\r\nThe interests section also was reworked, as I found the first iteration of the section to be irrelevant, as it offered no more information about myself. Now, there is a paragraph under each interest explaining why I chose it along with some creators I follow that specialize under that interest.\r\n\r\n![Projects Section](/assets/blog/new-website/interests.webp)\r\n\r\n# Additions\r\n\r\nThere were many new additions to the website, which were mostly new pages. In an effort to further make this website personal to me, I added three pages: The blog, my reading list, and my resume. I had decided on integrating a blog onto this website as I desired a creative outlet for writing about certain items of interest and to also just improve my writing skills in general. I plan to write generally about my life, events that are occurring in the field of technology, and other general topics I feel like writing about. As of right now, there is only one blog post (this one!), but there will be more to arrive in the near future. The reading list section lists all books I have read so far. I wanted to add this piece to the new iteration as a place to showcase my growth and to connect with like-minded people through reading. I added a resume page as I want to showcase my achievements and projects along with providing an outlet for employers to view it. My resume was originally built in HTML and CSS, but I had decided to recreate in LaTeX using [Overleaf](https://www.overleaf.com/), as it produces high-quality professional documents with organized structure. Also, I just learned it because learning new languages is something every programmer should strive to do.\r\n\r\n# Trials & Tribulations\r\n\r\n![Projects Section](/assets/blog/new-website/edge-runtime.webp)\r\n\r\nUnironically, this blog was the hardest section of the website to implement. Back when the website launched around January 2025, I already had a fully working solution for this blog. But there was just one problem. Remember when I told you that this website was hosted on Cloudflare? It turns out Cloudflare runs website on something called the Edge Runtime. Edge is an alternative to traditional Node.js runtime, designed for lower latency and better performance. Since this website was created using Node.js, the blog was utilized to use Node.js packages such as `fn` and `path`. Since those two packages, which simplified the blogging process, were not allowed, I had to find a different method of displaying blogs. I eventually found a method to quell this roadblock by generating a JSON file containing each blog post (in the form of a MDX file), and fetching that JSON file to render each post.\r\n\r\n# Conclusion\r\n\r\nThis should be the first of many blog posts to arrive on this website so stay tuned! If you made it to the end of the post, thank you for your time and I look forward to sharing more exciting content with you in the future.\r\n"
  },
  {
    "slug": "shad-unb-2025",
    "meta": {
      "title": "Shad UNB 2025",
      "description": "My experiences with Shad Canada and how it was the longest shortest summer!",
      "date": "January 1, 2026",
      "keywords": [
        "Aayush Sood"
      ]
    },
    "content": "\r\n![Thumbnail](/assets/blog/shad-unb-2025/shad-logo.webp)\r\n\r\nI had been meaning to write this blog post for a while, but it wasn’t until winter break that I finally sat down to do it, so I apologize for the delay.\r\n\r\nIn the summer of 2025, I attended Shad at the University of New Brunswick, a STEAM and entrepreneurship program for Canadian high school students in grades 10–11. On paper, it sounds generic, almost interchangeable with dozens of other summer programs. But that description completely misses the point.\r\n\r\nShad was not just a program. It was a month where time felt distorted. Days were long, nights were longer, and somehow the entire experience disappeared far too quickly. It was a stretch of late nights, uncomfortable challenges, constant learning, and people who pushed me to think harder, work faster, and believe more confidently in my own ideas. Looking back now, it was the longest and shortest month of my life, and one that quietly reshaped how I see learning, collaboration, and myself.\r\n\r\n# What is Shad?\r\n\r\n![Joy Kidd](/assets/blog/shad-unb-2025/joy-kidd.webp)\r\n\r\nShad is a month-long STEAM and entrepreneurship program for Canadian high school students that runs on university campuses across the country. Fundamentally, Shad is about bringing together curious, motivated students and pushing them outside their comfort zones through hands-on problem solving and collaboration.\r\n\r\nThroughout the program, students work in teams to tackle real-world design challenges, attend lectures and workshops led by professors and industry professionals, and develop ideas under tight timelines. Days are long and fast-paced, often blending technical work, creative thinking, and presentation skills into a single project.\r\n\r\nWhat makes Shad different from a typical summer program is its intensity and community. You are constantly surrounded by people who are as driven and curious as you are, which creates an environment where learning happens rapidly; and where you quickly realize how much more capable you are than you initially thought.\r\n\r\nWhat I didn’t realize before arriving was how immersive this environment would be. When you spend every day surrounded by people who are just as curious and driven as you are, growth becomes unavoidable. You start to raise your own standards without being asked, not because you feel pressured, but because the people around you inspire you to do better.\r\n\r\n# This sounds fun... How do I Participate?\r\n\r\n![Whale Watching](/assets/blog/shad-unb-2025/whale-watching.webp)\r\n\r\nIf this sort of thing excites you, there is an application process that can be found on Shad's [website](https://www.shad.ca/). The application typically opens around September and closes in January, as of the Shad 2026 application cycle.\r\n\r\nThe application consists of basic personal information, several essay questions, and your academic history. It is not particularly long, but it does require you to slow down and think intentionally about your motivations for applying and the experiences that have shaped you. Looking back, completing the Shad application actually prepared me well for the structure and reflection required in university applications. I often receive questions about the essays and academics in particular, so it is worth breaking those down.\r\n\r\nIn terms of the essay questions, Shad is not looking for applicants who have accomplished extraordinary or unrealistic feats by the time they are fifteen. Instead, they are looking for students who are curious about the world around them and who demonstrate drive, creativity, and a sense of community. These qualities can be shown in many different ways. This could be through leadership in a school club, involvement in theatre or the arts, volunteering at summer camps, or any experience where you took initiative and learned something meaningful. My biggest piece of advice is to directly connect your experiences to the essay prompts so Shad can clearly see how those moments shaped who you are today.\r\n\r\nFor academics, you are required to submit a report card containing your grades from the previous academic year. Shad does not have strict grade cutoffs. They are mainly looking to see whether you are academically prepared for the pace of the program. In my opinion, your essays and the personality you convey through them matter far more than perfect grades. Focus on telling your story honestly rather than trying to impress through numbers alone.\r\n\r\nAfter being accepted, you rank your preferred university placements and Shad does its best to match students with their top choices.\r\n\r\nIn hindsight, the application felt less like a test and more like an invitation to reflect. Shad was not asking who I wanted to become, but who I already was and why that mattered. That mindset carried into the program itself. The students who thrived were not the ones with the most impressive achievements on paper, but the ones who were open to learning, questioning, and growing alongside others.\r\n\r\nFor me, I was placed at the University of New Brunswick in Fredericton from June 29 to July 25. Since New Brunswick is relatively close to my hometown of Halifax, Nova Scotia, the commute was much easier compared to the journeys some others made, though once we arrived, we were all equally far from home in the ways that mattered.\r\n\r\n# First Week\r\n\r\n![Whale Watching](/assets/blog/shad-unb-2025/room.webp)\r\n\r\nThe first week was awkward in the way all beginnings are. Conversations revolved around names, hometowns, and polite small talk, but beneath that surface was a shared uncertainty. Everyone was trying to figure out where they fit, how much of themselves to show, and whether they truly belonged in a room full of unfamiliar faces.\r\n\r\nThat week mattered more than I realized at the time. It quietly set the tone for everything that followed. The simple decisions to talk to someone new, to sit beside people you did not yet know, and to lean into discomfort made the difference between simply attending Shad and fully experiencing it.\r\n\r\n![Shad Bridge Group Photo](/assets/blog/shad-unb-2025/shad-bridge.webp)\r\n\r\nOur campus was made up of 52 Shads, along with Program Assistants and Program Directors. The Program Directors coordinated the structure of each day, while the Program Assistants worked closely with us to guide activities, support discussions, and keep everything running smoothly. As a participant, I spent far more time with my PAs than with the PDs, and they quickly became some of the most familiar faces on campus.\r\n\r\nMost of my fellow Shads were far from home, with many flying into Fredericton from across the country. A large portion of the group came from Ontario, particularly the Greater Toronto Area, but there were also students from the Prairies and Atlantic Canada. Despite our different backgrounds, we were all navigating the same unfamiliar environment together.\r\n\r\nWe were divided into house groups, smaller communities within the larger group that often participated in activities and trips together. I was placed in the Blueberries house group, which quickly became a space of comfort, laughter, and support. Each day began with a loosely structured schedule that hinted at the busy hours ahead, but much of what made those days meaningful came from the moments in between, the conversations, shared nerves, and the growing sense that this unfamiliar place was slowly becoming home.\r\n\r\n![Schedule](/assets/blog/shad-unb-2025/schedule.webp)\r\n\r\nMost of the week was spent participating in team building activities and games that were designed to help us connect with one another on a deeper level. These moments, though sometimes lighthearted or awkward at first, laid the foundation for the friendships and collaboration that defined the rest of the program. Our days quickly settled into a rhythm of lectures, labs, shared meals, recreational activities, and quiet social time before our mandated curfew, creating a structure that felt both intense and strangely comforting.\r\n\r\n![Paper Tower Challenge](/assets/blog/shad-unb-2025/paper-tower-challenge.webp)\r\n\r\nPart of the Shad experience involved crafting our very own meals in the mess hall, sometimes in a classy manner, though I cannot speak for everyone. Assembling food quickly became both a necessity and a shared ritual, where creativity and chaos often went hand in hand. If you want a glimpse into the kinds of meals that emerged, including the occasional meatballs and jello combination, I highly recommend checking out the Shad UNB Food Reviews [Instagram](https://www.instagram.com/shadunb_foodreviews_25/) account!\r\n\r\n![Food](/assets/blog/shad-unb-2025/food.webp)\r\n\r\nWe were also introduced to the Design & Entrepreneurship (DE) project, a month long, team based challenge where students work together to tackle some of the most complex problems facing Canadian society. The project emphasizes human centred design, iteration, and entrepreneurship, pushing teams to move from broad problem spaces to tangible, well justified solutions under tight timelines. Each year, all Shad campuses work on the same overarching challenge, allowing ideas to emerge from a shared national problem. The project culminates in a pitch style competition, where teams present their solutions to judges and compete for prizes. For Shad 2025, the problem statement was: How might we design innovative and sustainable transportation solutions that meet the needs of people in Canada? More on that later.\r\n\r\n# Trips & Learning\r\n\r\n![Camping](/assets/blog/shad-unb-2025/camping.webp)\r\n\r\nPart of the Shad experience involves embarking on trips around the surrounding region and campus area, giving us a chance to learn outside of classrooms and labs.\r\n\r\nOn our first trip, we visited the [Point Lepreau Nuclear Generating Station](https://www.cnsc-ccsn.gc.ca/eng/reactors/power-plants/point-lepreau-nuclear-generating-station/), the only nuclear power plant in Atlantic Canada. While we were not allowed to take photos, the visit offered a rare look into how nuclear power plants operate and the extensive security measures required to protect such critical infrastructure. These trips are carefully planned in advance, giving us access to places that are otherwise difficult to visit.\r\n\r\nOur second trip took us to [Mactaquac Provincial Park](https://www.parcsnbparks.ca/en/parks/10/mactaquac-provincial-park) for a camping experience. Camping is a tradition shared across many Shad campuses, and it quickly became one of the most memorable parts of the program. It was equal parts chaotic and fun, and I would definitely recommend bringing any treasured camping supplies, including power banks. \r\n\r\n![Campfire](/assets/blog/shad-unb-2025/campfire.webp)\r\n\r\nThis was my first time camping, and I could not have imagined a better way to experience it than alongside people who, in such a short time, had begun to feel like a community. It was a space where learning and connection happened just as naturally outside the program as within it.\r\n\r\n![Travelling in Saint John](/assets/blog/shad-unb-2025/saint-john.webp)\r\n\r\nOn our third trip, we travelled south to Saint John, New Brunswick. The goal of the trip was to explore the local markets and to tour the [Port of Saint John](https://www.sjport.com/) with its CEO, Craig Estabrooks. The experience offered valuable insight into the complex processes that keep a major port operating smoothly, especially one of the largest ports in the Atlantic provinces.\r\n\r\n![Huntsman Marine Science Centre](/assets/blog/shad-unb-2025/st-andrews-aquarium.webp)\r\n\r\nOn our fourth and final trip, we visited St. Andrews, New Brunswick, a northern town famous for its whales. Our group explored the [Huntsman Marine Science Centre](https://www.huntsmanmarine.ca/aquarium), where we conducted a lab using microscopes to analyze microorganisms in the sea. One of the most exciting parts of the trip was whale watching, though I unfortunately have no photos of the whales. Even so, the journey on the ocean offered breathtaking views that made the experience unforgettable.\r\n\r\n![Seals](/assets/blog/shad-unb-2025/seals.webp)\r\n\r\nAlongside these trips, the lectures at Shad were another crucial part of learning. They were more than just presentations, they were opportunities to see the world from perspectives I had never considered. The lecture that stood out for me was delivered by the Nuclear Waste Management Organization on transporting nuclear waste safely and responsibly. It was fascinating to see the depth of planning, technology, and care required to manage something so complex and high-stakes. Beyond the technical details, it was a lesson in responsibility, ethics, and the impact of engineering decisions on communities.\r\n\r\n![Robotics](/assets/blog/shad-unb-2025/robotics.webp)\r\n\r\nOther lectures on entrepreneurship, sustainable design, and human-centred problem solving inspired us to think critically about our own projects. What made these sessions meaningful was not just the content, but the conversations they sparked, whether in the hallways, over meals, or during late-night discussions with peers. They reminded me that learning at Shad happens everywhere, in lectures, projects, trips, and even casual moments.\r\n\r\nOverall, the trips and lectures gave us the chance to step outside the structure of campus life and experience Shad from different perspectives. They allowed us to explore new environments, connect more deeply with one another, and momentarily slow down in the midst of an otherwise fast-paced program. Some of the most meaningful moments at Shad did not come from scheduled activities alone, but from shared experiences and reflections that brought us closer together.\r\n\r\n# Design & Entrepreneurship Project\r\n\r\n![DE Cohort](/assets/blog/shad-unb-2025/de-cohort.webp)\r\n\r\nA couple of sections ago, I mentioned a fun component of Shad called the Design & Entrepreneurship (DE) project. At first, it didn’t feel like the main focus, but by the second and third weeks, it became a central part of our experience. All 52 of us were divided into groups of 4–5 and given a broad topic within the larger problem statement to explore.\r\n\r\nOur group was tasked with addressing the social stigma around using public transportation. This was an issue I was already familiar with, as public transit in Halifax has often been viewed as inconvenient or undesirable. Unsure where to start, we reached out to Canadians across the country with a simple survey to better understand the challenges.\r\n\r\nAnalyzing the responses, we identified several recurring issues: limited access to buses, inconsistent schedules, and concerns about hygiene. Our group decided to tackle the hygiene aspect, aiming to develop a solution that would make buses cleaner, more appealing, and more trusted by riders in Halifax.\r\n\r\nThroughout the process, we were trained on entrepreneurship principles by staff from the [J. Herbert Smith Centre for Technology Management and Entrepreneurship](https://www.unb.ca/fredericton/engineering/depts/tme/), which helped us structure our ideas, consider real-world feasibility, and think critically about turning a concept into an actionable solution.\r\n\r\n![Business Model Canvas](/assets/blog/shad-unb-2025/business-model-canvas.webp)\r\n\r\nAfter understanding the issue we needed to solve, we had to develop a [Business Model Canvas](https://en.wikipedia.org/wiki/Business_model_canvas). A Business Model Canvas is essentially a way to think through whether an idea could exist in the real world. Instead of focusing only on the solution itself, it forces you to consider who the idea is for, what problem it solves, and how it could realistically be implemented and sustained. At Shad, we used it to move beyond just having an interesting concept and start thinking about practicality; costs, partnerships, and how people would actually interact with what we were designing. It helped turn abstract ideas into something more grounded and intentional.\r\n\r\n![HyRide Logo](/assets/blog/shad-unb-2025/hyride-logo.webp)\r\n\r\nAfter crafting our business model, we established our company, HyRide. HyRide is a public transit hygiene solution designed to make buses cleaner, more reliable, and more appealing to riders. The company installs an efficient disinfectant misting system on buses that sanitizes interiors in under a minute between routes and performs deeper overnight cleaning, reducing delays caused by manual cleaning while improving overall cleanliness. By pairing this system with added hygiene features (such as trash bins and hand sanitizer dispensers) and a strong public-facing marketing campaign, HyRide aims to change public perception of buses from unhygienic to a smart, safe, and convenient transportation choice. Ultimately, HyRide helps transit agencies increase ridership, reduce delays, and rebuild trust in public transit.\r\n\r\n![HyRide Finances](/assets/blog/shad-unb-2025/hyride-finances.webp)\r\n\r\nMy role within the organization is the Chief Financial Officer (CFO). Taking on the role of CFO forced me into unfamiliar territory. I was suddenly responsible for decisions that affected the entire team, often without feeling fully confident in the numbers I was working with. There were moments of frustration, confusion, and doubt, especially late at night when the calculations refused to make sense. But working through that uncertainty taught me more than getting the right answer ever could. It showed me that leadership often means staying engaged even when you don’t feel prepared.\r\n\r\n![HyRide Poster](/assets/blog/shad-unb-2025/hyride-poster.webp)\r\n\r\nThe day of the pitch competition arrived, and most teams, including ours, were nervous about what lay ahead. The competition had two stages. First, we presented our team poster to a panel of judges, delivering a concise elevator pitch of our product. Then came the main pitch presentation, where we showcased our solution to another set of judges as well as our Shad cohort.\r\n\r\n![HyRide Preliminary Pitch](/assets/blog/shad-unb-2025/de-preliminary-pitch.webp)\r\n\r\nOur team delivered a concise and compelling elevator pitch to the judges, who seemed genuinely interested in our product. After the first stage, we moved to the auditorium to present to our peers and judges, showcasing the months of hard work, collaboration, and iteration that had gone into our project.\r\n\r\n![HyRide Pitch](/assets/blog/shad-unb-2025/de-pitch.webp)\r\n\r\nEach presentation lasted at most five minutes, followed by a Q&A session with the judges. Standing on stage, I didn’t feel polished or confident. I noticed every stumble, every word I wished I had phrased differently. Yet, watching my teammates present with clarity and conviction reminded me that success isn’t always about individual performance. Sometimes it’s about trusting those beside you and knowing when to step back and let the team shine.\r\n\r\n![HyRide Group Picture](/assets/blog/shad-unb-2025/hyride-group.webp)\r\n\r\nOverall, the DE project taught me that good ideas are rarely fully formed at the start. They grow through iteration, disagreement, and pressure, often improving only after being challenged by others. More than anything, it showed me how much stronger ideas become when you stop trying to solve a problem alone.\r\n\r\n# The Final Week\r\n\r\n![UNB Mess Hall](/assets/blog/shad-unb-2025/unb-mess-hall.webp)\r\n\r\nThe final week moved at a pace that felt unfair. Every moment carried weight, knowing it was limited. Conversations felt more intentional, laughter came easier, and goodbyes began forming long before anyone actually left.\r\n\r\nI made it a goal to truly spend time with every person in the cohort and get to know them as deeply as I could. I realized that I hadn’t connected with everyone as much as I wanted, and I was determined not to let the final week pass without fully engaging with my community.\r\n\r\nSometime during the final week, in between presentations and quiet moments that felt heavier than the days before, I learned that I had been elected valedictorian by my peers. The news didn’t feel triumphant as much as it felt grounding; a reminder of the people and shared experiences that had shaped the month.\r\n\r\n![Speech Podium](/assets/blog/shad-unb-2025/speech-podium.webp)\r\n\r\nTo celebrate our time at Shad, a banquet was hosted by the staff of Shad, even inviting our parents to observe. Part of my role as valedictorian was to deliver a culminating speech outlining our journey and the future ahead.\r\n\r\n![Final Shad Group Picture](/assets/blog/shad-unb-2025/final-shad-group-picture.webp)\r\n\r\nAt the end, we returned to our rooms and began packing our bags, quietly realizing that the month we had been living so fully was coming to an end. On our final night, we stayed up late signing each other’s monthbooks, filling pages with inside jokes, memories, and promises to keep in touch. The next morning came too quickly. Those with early flights were bussed away, one by one, while a few of us stayed back on campus, lingering longer than necessary. The goodbyes were harder than I expected; brief hugs, quiet words, and the shared understanding that something meaningful was ending, even though its impact would last far beyond that morning.\r\n\r\n# The People\r\n\r\n![Group Picture #1](/assets/blog/shad-unb-2025/people-1.webp)\r\n\r\nWhen I think back on Shad, the first thing that comes to mind isn’t a lecture, a project deadline, or even a trip; it’s the people. I arrived on campus carrying a suitcase and a lot of uncertainty, surrounded by faces I didn’t recognize and names I couldn’t yet place. Within days, those strangers became the constant presence of my month: the people I learned with, struggled alongside, laughed with, and eventually couldn’t imagine leaving behind.\r\n\r\nWhat made the people at Shad special wasn’t just how accomplished or driven they were, but how open they chose to be. Everyone showed up as themselves, curious, passionate, and unafraid to care deeply. Conversations rarely stayed on the surface. It was normal to talk about ambitions, fears, and values late into the night, sitting on residence floors or walking across campus long after we were supposed to be asleep. Being in an environment where curiosity was celebrated made vulnerability feel natural.\r\n\r\n![Group Picture #2](/assets/blog/shad-unb-2025/people-2.webp)\r\n\r\nI also want to give a huge shoutout to our Program Directors, Katie and Kamryn, and Staff Team, Declan, Billy, Zoe, Anshika, Regan, Avani, Ryan, Tanya, Matt, and Fasih. They were the guiding hands behind the scenes, organizing activities, answering questions, and keeping everything running smoothly. More than that, they made the campus feel welcoming and safe, offered advice and encouragement at every step, and created an environment where we felt empowered to explore, fail, and grow. Their support was crucial in shaping the month into the incredible experience it became.\r\n\r\nThere was a quiet kind of support woven into everyday moments. People stayed behind to help teammates refine ideas, explained concepts without judgment, and checked in on one another when the pace of the program became overwhelming. During the DE project especially, I saw how collaboration could coexist with intensity and how competition never overshadowed empathy. We pushed each other to be better, not out of pressure, but out of belief in one another.\r\n\r\nAs the weeks passed, routines formed. Certain people became the ones you always sat next to, the ones you walked back to residence with, the ones you looked for in a crowded room. Inside jokes accumulated, group chats filled up, and shared exhaustion turned into shared pride. Somewhere along the way, Shad stopped feeling like a program and started feeling like a community.\r\n\r\n![Group Picture Containing Stardew Valley](/assets/blog/shad-unb-2025/stardew-valley.webp)\r\n\r\nSaying goodbye was far harder than I had anticipated. It was difficult to accept that the people who had become such a central part of my life in just a month would soon be scattered across the country again. Yet, there was also comfort in knowing that these connections weren’t defined by proximity, but by the experiences we shared and the growth we witnessed in one another.\r\n\r\nShad brought together people who challenged the way I think, reminded me why I love learning, and showed me the power of being surrounded by those who care deeply, not just about success, but about each other.\r\n\r\n![Group Picture #3](/assets/blog/shad-unb-2025/people-3.webp)\r\n\r\nLong after the details of lectures and projects blur together, it’s these people I will remember most. They are the reason Shad feels less like a month I attended and more like a chapter I lived.\r\n\r\n# Living on Campus\r\n\r\n![University of New Brunswick](/assets/blog/shad-unb-2025/UNB.webp)\r\n\r\nLiving on campus for a month was an entirely new experience, and one that surprised me in how much it changed my perspective. From unpacking my suitcase in a small dorm room to navigating shared bathrooms and common spaces, it was my first taste of independence on this scale. Simple routines like cooking breakfast in the mess hall, walking across campus to lectures, or staying up late with friends took on a new significance when you were responsible for managing your own time and space.\r\n\r\n![Karaoke Night](/assets/blog/shad-unb-2025/karaoke-night.webp)\r\n\r\nThere was something special about sharing a floor with a group of people you were just getting to know. Late-night conversations, quiet study sessions, and the small moments in between classes gave life to the friendships that would define the month. Living together forced us to navigate disagreements, coordinate schedules, and celebrate little wins, from making a meal together to solving a tough DE project challenge.\r\n\r\nEven the mundane parts, like laundry or tidying a shared room, became moments of reflection. They reminded me that independence isn’t just about freedom; it’s about responsibility, respect, and learning to take care of yourself while being part of a community.\r\n\r\n![Coffee House](/assets/blog/shad-unb-2025/coffee-house.webp)\r\n\r\nBy the end of the month, campus life no longer felt like a temporary experience. It felt like a small, self-contained world where I had grown into routines, relationships, and habits that I might not have discovered otherwise. Living on campus taught me that independence is not just about doing things on your own, but about learning how to connect, collaborate, and coexist with others in meaningful ways.\r\n\r\n# Reflection & Takeaways\r\n\r\n![Tree Group Picture](/assets/blog/shad-unb-2025/tree-group-picture.webp)\r\n\r\nLooking back, Shad was far more than a summer program; it was a month that challenged me in ways I didn’t expect and taught me lessons I will carry long after. It pushed me to step out of my comfort zone, to try things I wasn’t sure I could do, and to trust in my own abilities while relying on the people around me.\r\n\r\nOne of the biggest takeaways was how much growth comes from collaboration. The DE project, late-night discussions, and even small daily interactions reminded me that ideas become stronger when they are shared, challenged, and refined alongside others. I learned that leadership is not about having all the answers, but about listening, contributing, and helping others shine.\r\n\r\n![Lunch Group Picture](/assets/blog/shad-unb-2025/lunch-group-picture.webp)\r\n\r\nShad also taught me about resilience and adaptability. The pace was intense, mistakes were inevitable, and not every plan worked perfectly, but that is where the real learning happened. I realized that failure is not a setback but an opportunity to iterate, improve, and see problems from a new perspective.\r\n\r\nBeyond skills and knowledge, Shad left me with a renewed sense of curiosity and a deeper appreciation for community. The people I met, the late-night conversations, the shared struggles, and even the quiet moments alone all shaped the way I think, collaborate, and approach challenges today.\r\n\r\n![Camping Group Picture](/assets/blog/shad-unb-2025/camping-group-picture.webp)\r\n\r\nShad did not give me all the answers. Instead, it gave me better questions, stronger habits, and a deeper appreciation for learning alongside others. It reminded me that growth is rarely comfortable, but it is always worth leaning into. A month may seem short on paper, but sometimes that is all it takes to change the way you move forward.\r\n\r\n# Advice for Future Shads\r\n\r\n![Farmers Market Group Picture](/assets/blog/shad-unb-2025/farmers-market-group-picture.webp)\r\n\r\nIf I could give advice to future Shad participants, it is simple: Shad is what you make of it. The program will only be as meaningful as the energy, curiosity, and effort you bring. Step out of your comfort zone, ask questions, explore new ideas, and dive into every experience, big or small.\r\n\r\nFor those who are on the fence about applying, I would say this: the program can feel intimidating at first, but the people, the experiences, and the challenges make it worth it. You will meet students from all over the country who are curious, driven, and welcoming. Even if you are unsure about whether you \"fit in,\" you will quickly find a place in the community and discover strengths in yourself that you didn’t know were there.\r\n\r\n![Public Display of Appreciation](/assets/blog/shad-unb-2025/pda.webp)\r\n\r\nFinally, take moments to reflect. Pause, think about what you are learning, and appreciate how far you have come. The lessons, memories, and friendships you take away will last long after the month ends. At the end of the day, the experience is yours to shape, and the more you put into it, the more you will get out of it.\r\n\r\nShad is what you make of it. The opportunities are there, but it’s your willingness to engage, reflect, and care that turns the experience into something meaningful.\r\n\r\n# Photo Credits\r\n\r\nA huge thank you to all the photographers who helped bring this blog to life, including [Cameron Chung](https://www.instagram.com/cameron.h.c.photography/), [Jason Lin](https://www.instagram.com/jasoonese/), [Piraba Nathan](https://www.instagram.com/worthv2/) and others. The moments they captured are more than just pictures. They preserve memories, emotions, and the energy of an incredible month. Any remaining photos were taken by me. Without these images, the story of Shad would not feel as vivid, personal, or alive."
  }
]