[
  {
    "slug": "lockheed-martin-cyberquest-2025",
    "meta": {
      "title": "Bay View High at CYBERQUEST 2025: Lessons in Cybersecurity and Teamwork",
      "description": "My experiences in preparing and competing at the Lockheed Martin CYBERQUEST Competition alongside the Bay View High School Tech Club!",
      "date": "August 22, 2025",
      "keywords": [
        "Aayush Sood",
        "Lockheed Martin CyberQuest",
        "Cybersecurity competition",
        "High school CTF",
        "Student cybersecurity challenge",
        "Bay View High School Tech Club"
      ]
    },
    "content": "\r\n![Lockheed Martin Logo](/assets/blog/lockheed-martin-cyberquest-competition-2025/lockheed-martin-logo.webp)\r\n\r\nWhen our [Tech Club](https://bvh-tech-club.netlify.app/) first heard about a chance to compete in a real cybersecurity competition, we never imagined ourselves racing against other schools in a high-stakes hacking challenge. The [Lockheed Martin CYBERQUEST Competition](https://www.lockheedmartin.com/en-us/who-we-are/communities/cyber-quest.html), held in-person across Canada, the U.S., and Australia, is an annual cybersecurity event for high school students. The nearest Lockheed Martin office from our school was just a short distance away in Dartmouth, Nova Scotia.\r\n\r\nThe competition consisted of Capture the Flag (CTF) challenges, which are exercises that involve finding a specific text string within a given problem. For example, a problem may involve investigating a website's source code to find a specific string, such as Y0U_F01ND_M3. Teams that gain the most points out of solving multiple of these challenges in the three-hour competition win 1st place, while others place in the top 3.\r\n\r\nEach high school team consisted of 3-5 members, so we decided on bringing four other passionate Tech Club members and myself to this competition. Categories of challenges spanned from web-based attacks, Cryptography, Social Engineering, and more. Our team was not fully aware of these concepts, so we spent the next few weeks preparing for the competition, which will be hosted in the Dartmouth office on March 29, 2025. We registered our team as Bay View High School SharkBytes.\r\n\r\nWe knew we had a lot to learn before the big day, so we dove into weeks of preparation.\r\n\r\n# Preparation\r\n\r\n![PicoCTF](/assets/blog/lockheed-martin-cyberquest-competition-2025/picoctf.webp)\r\n\r\nOur team wasn't quite sure how to prepare for such an event, especially when it was our first time learning about the broad field of cybersecurity. We eventually stumbled on a platform that prepares you for CTF competitions, called [PicoCTF](https://picoctf.org/). PicoCTF offered problems of varied difficulty and a broad selection of categories, which was perfect for preparing for the competition.\r\n\r\nOur team made an effort to solve one challenge a day leading up to the competition. We made it an essential objective to especially focus on problems that involve technical areas that we were unfamiliar with, so we can expand our skillsets while focusing less on what we already knew.\r\n\r\nI led a [workshop](https://www.instagram.com/p/DGKInY3se8Y/) for all Tech Club members on PicoCTF and how CTF challenges work, as I found it to be the perfect time to introduce cybersecurity as a career possibility for all Tech Club members.\r\n\r\nWant to see more of our club's activities, projects, and updates? Follow us on Instagram at [@bvhstechclub](https://www.instagram.com/bvhstechclub/) to stay connected and support our cause!\r\n\r\n![Tech Club Cybersecurity Workshop](/assets/blog/lockheed-martin-cyberquest-competition-2025/cybersecurity-workshop.webp)\r\n\r\n# Competition day\r\n\r\n![Lockheed Martin Dartmouth](/assets/blog/lockheed-martin-cyberquest-competition-2025/lockheed-martin-dartmouth.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-Mk4M2BC/A)_\r\n\r\nThe day of the competition rolled around and we were all excited to enter the office of Lockheed Martin and learn the art of cybersecurity. We entered an area of the building and encountered two other teams there. The rules of the competition were explained to us. Here's a quick summary:\r\n\r\n- Challenges ranged in difficulty and point value.\r\n- Teams could spend points for hints.\r\n- Web usage was allowed, with the exception of posting on forums to find answers.\r\n- Generative AI was also allowed, but copying and pasting the challenge prompt into the AI was not allowed.\r\n\r\nThe competition commenced and we got straight to cracking the various cybersecurity problems presented to us.\r\n\r\n![SharkBytes in Competition](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-competing.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-4RZPmtN/A)_\r\n\r\nWe tackled problems concerning Forensics, General Trivia Questions, Operating Systems, and more. Our team worked well, as each of us tackled a separate problem in an effort to gain the most points possible. We decided to tackle the easier, low-point problems first to accumulate points quickly, then moved on to the harder problems. I personally tackled packet analysis through Wireshark, phishing, and web-based problems.\r\n\r\nIt was very competitive, as all three teams were at one point leading one another, but only ever so slightly. There were moments when just one problem made the difference between first and third place. At one point, all five of us came together to tackle a set of tricky trivia questions. We struggled at first, but the solution only emerged after everyone threw in their ideas. That moment was a reminder that the best breakthroughs come from teamwork, not individual effort. The competition felt tense yet very friendly, with all the participants typing away at their computers.\r\n\r\nAfter a very close competition, our team placed 3rd, and we had a pizza party. Our team received medals and a nice trophy, and we celebrated.\r\n\r\n![SharkBytes Team Picture](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-team-picture.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-bv83stV/A)_\r\n\r\n# Takeaways\r\n\r\nThis competition taught us a variety of tools and techniques. We learned tools such as\r\n\r\n- [Wireshark](https://www.wireshark.org/) - lets you see and analyze the data moving across a network.\r\n- [Burp Suite](https://portswigger.net/burp) - A toolkit for finding security flaws in websites.\r\n- [CyberChef](https://gchq.github.io/CyberChef/) - nicknamed the \"cyber Swiss Army knife,\" it helps decode and transform encrypted text or data.\r\n- [Metasploit](https://www.metasploit.com/) - A framework for safely testing vulnerabilities in systems to understand how attackers might break in.\r\n- [Kali Linux](https://www.kali.org/) - A special operating system loaded with cybersecurity tools used by professionals.\r\n\r\nDue to this being our first team competition, I learned many soft skills, such as leadership, communication, and delegating tasks to my team in real time during a contentious competition such as this.\r\n\r\n# Impact and What's Next\r\n\r\n![SharkBytes Team Picture](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-posing.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-5BpxkLB/A)_\r\n\r\nThis experience reshaped how I see cybersecurity. Before CyberQuest, I thought of it as a niche field for experts. Now, I realize it touches everything, from protecting personal data on social media to safeguarding national infrastructure.\r\n\r\nWith businesses, governments, and even schools relying so heavily on technology, the need for cybersecurity professionals is only going to grow.\r\n\r\nFor me, what started as a school competition has now sparked a genuine interest in a career path that impacts almost every part of modern life.\r\n\r\nIf you've ever been curious about cybersecurity, even if it seems intimidating, dive in. Competitions like CyberQuest prove that with teamwork, creativity, and persistence, anyone can start building these skills. You don't need to be an expert; you just need curiosity and a willingness to learn.\r\n\r\nFor us, what began as a club project turned into an unforgettable experience, and possibly even a career path. Who knows? You first challenge might spark the same for you.\r\n"
  },
  {
    "slug": "new-website",
    "meta": {
      "title": "New Website!",
      "description": "This is my first ever blog post! I will be going into the new website, why I built it, the tech stacked used, updates, additions, and the trials and tribulations faced along the journey!",
      "date": "March 15, 2025",
      "keywords": [
        "Aayush Sood"
      ]
    },
    "content": "\r\n![New Website](/assets/blog/new-website/new-website.webp)\r\n\r\nHello World! This may seem new to you, but I now have a website that represents who I am and my interests in an organized manner. I will be going into why I decided to make an entirely new website from scratch, what tools I used, updates & additions, and the trials and tribulations faced during the journey.\r\n\r\n# The Old Website\r\n\r\n![Old Website](/assets/blog/new-website/old-website.webp)\r\n\r\nI had developed the [first iteration](https://portfolio-website-4v4.pages.dev/) of my personal portfolio during the winter break of 2023. It served as a good showcase of my skills and projects at the time, but I had felt that the interface was not as appealing, and that there could have been more information present. I was thinking of updating the original website itself, but found that since I had developed it in basic HTML, CSS, and JavaScript, that it would become tedious to implement complex features such as a blog. I had decided on creating a new website that uses an actual frontend framework to simplify the process of building and adding onto it.\r\n\r\n# Tech Stack\r\n\r\n![Projects Section](/assets/blog/new-website/tech-stack.webp)\r\n\r\nFor this website, I had decided to use the [Next.js](https://nextjs.org/) framework, which is powered by [React.js](https://react.dev/). I had decided on choosing Next.js due to its widely known performance metrics and its SEO optimizations. For all animations on this website, the [Motion](https://motion.dev/) package was used as it provided a simple and seamless experience when creating them. The [React-Icons](https://react-icons.github.io/react-icons/) package was used in a few places on this website, mainly in the Interests section on the Home page and the mobile header. [MDX](https://mdxjs.com/) was used to make it easier for me to write blogs as I was already familiar with Markdown. I use [Cloudflare](https://www.cloudflare.com/) to host this website, as it provides real-time analytics along with DDoS protection.\r\n\r\n# Updates\r\n\r\nMost of the updates made on this new iteration mostly concern the home page. I reworked the entire projects section to be a carousel that is guided by you, the user. This way, the section does not take up as much space as the first iteration did, which is essential when adding more projects to the list.\r\n\r\n![Projects Section](/assets/blog/new-website/projects.webp)\r\n\r\nThe interests section also was reworked, as I found the first iteration of the section to be irrelevant, as it offered no more information about myself. Now, there is a paragraph under each interest explaining why I chose it along with some creators I follow that specialize under that interest.\r\n\r\n![Projects Section](/assets/blog/new-website/interests.webp)\r\n\r\n# Additions\r\n\r\nThere were many new additions to the website, which were mostly new pages. In an effort to further make this website personal to me, I added three pages: The blog, my reading list, and my resume. I had decided on integrating a blog onto this website as I desired a creative outlet for writing about certain items of interest and to also just improve my writing skills in general. I plan to write generally about my life, events that are occurring in the field of technology, and other general topics I feel like writing about. As of right now, there is only one blog post (this one!), but there will be more to arrive in the near future. The reading list section lists all books I have read so far. I wanted to add this piece to the new iteration as a place to showcase my growth and to connect with like-minded people through reading. I added a resume page as I want to showcase my achievements and projects along with providing an outlet for employers to view it. My resume was originally built in HTML and CSS, but I had decided to recreate in LaTeX using [Overleaf](https://www.overleaf.com/), as it produces high-quality professional documents with organized structure. Also, I just learned it because learning new languages is something every programmer should strive to do.\r\n\r\n# Trials & Tribulations\r\n\r\n![Projects Section](/assets/blog/new-website/edge-runtime.webp)\r\n\r\nUnironically, this blog was the hardest section of the website to implement. Back when the website launched around January 2025, I already had a fully working solution for this blog. But there was just one problem. Remember when I told you that this website was hosted on Cloudflare? It turns out Cloudflare runs website on something called the Edge Runtime. Edge is an alternative to traditional Node.js runtime, designed for lower latency and better performance. Since this website was created using Node.js, the blog was utilized to use Node.js packages such as `fn` and `path`. Since those two packages, which simplified the blogging process, were not allowed, I had to find a different method of displaying blogs. I eventually found a method to quell this roadblock by generating a JSON file containing each blog post (in the form of a MDX file), and fetching that JSON file to render each post.\r\n\r\n# Conclusion\r\n\r\nThis should be the first of many blog posts to arrive on this website so stay tuned! If you made it to the end of the post, thank you for your time and I look forward to sharing more exciting content with you in the future.\r\n"
  }
]