[
  {
    "slug": "atlantic-canada-ai-summit-youth-ai-pitch-2025",
    "meta": {
      "title": "Bay View High at Atlantic Canada AI Summit: Lessons in AI and Collaboration",
      "description": "My experiences in developing IWKids and competing at the Youth AI Pitch Competition with the Bay View High School Tech Club, exploring how AI can make a real difference in our community!",
      "date": "September 1, 2025",
      "keywords": [
        "Aayush Sood",
        "Youth AI Pitch Competition",
        "Atlantic Canada AI Summit",
        "IWKids app",
        "Student AI challenge",
        "Bay View High School Tech Club",
        "STEM student projects",
        "AI prototyping for kids’ ER",
        "IWK Hospital innovation",
        "Saint Mary's University AI event",
        "“AI healthcare innovation”",
        "“student pitch competition”",
        "“emergency room AI app”"
      ]
    },
    "content": "\r\n![Youth AI Pitch Competition Banner](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/competition-banner.webp)\r\n\r\nAfter winning the [Lockheed Martin CYBERQUEST Competition](/blog/lockheed-martin-cyberquest-2025), our [Bay View High School Tech Club](https://bvh-tech-club.netlify.app/) turned its attention to a new challenge, one that aimed to tackle a real problem affecting our community.\r\n\r\nThe [Atlantic Canada AI Summit](https://www.smu.ca/ai-summit/index.html), hosted at [Saint Mary's University](https://www.smu.ca/) (SMU) in May 2025, aimed to showcase cutting-edge AI research, facilitate industry-academia collaboration, and highlight exceptional AI talent in the region. One of their programs featured was the [Youth AI Pitch Competition](https://www.smu.ca/ai-summit/may3.html), which tasked middle and high school teams to come up with innovative AI-driven solutions to enhance the Emergency Room experience for kids and their families at the [IWK Hospital](https://iwkhealth.ca/). The competition consisted of Generative AI workshops facilitated by SMU Master of Business Analytics students, with the contest commencing later in the afternoon.\r\n\r\nSimilar to CYBERQUEST, each team consisted of 3-5 members. I spread the word to Tech Club members and quickly found interested participants. Our team consisted of me, Seth, Yaya, and Baruch. Our team was assembled at the beginning of April, giving us about three weeks to create a prototype and pitch for the May 3 competition.\r\n\r\nUnlike CYBERQUEST, we now had to create a semi-functional product addressing a real community problem, rather than practicing hacking techniques.\r\n\r\nWe then began our research on problems that affect the Emergency Room and their potential solutions.\r\n\r\n# Planning\r\n\r\n![Youth AI Pitch Competition Banner](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/emergency-room.webp)\r\n\r\nWhen conducting our research on how we can improve the Emergency Room experience, we identified five main problems that cause stress for children and their parents:\r\n\r\n- Long wait times\r\n- Confusing procedures\r\n- Overwhelmed parents\r\n- Busy staff can't give 1:1 attention\r\n- Kids pick up on adult emotions, stressed parents result in overwhelmed kids\r\n\r\nWe had identified problems that affect the Emergency Room but weren't sure what a potential solution would look like, so I hosted a Tech Club workshop focused on finding a solution for this competition.\r\n\r\nDuring the workshop, I organized our members in groups, similar to the competition, and tasked them with proposing a concept of what a solution for these problems could look like. I gave them 30 minutes to develop an idea, then 15 minutes to pitch it to the rest of the club.\r\n\r\nMany ideas were proposed, such as:\r\n\r\n- An AI chatbot\r\n- Games for children\r\n- Feedback system for hospital staff\r\n- Virtual calls with doctors\r\n\r\nAlthough the ideas were very different, they all used one medium: mobile devices.\r\n\r\nIt made sense, the majority of the population today have mobile devices, and if we can make the Emergency Room experience easier for families through these devices, it would be really beneficial for the community.\r\n\r\nSince the app was designed to enhance the IWK Emergency Room experience for children and families, we named it **IWKids.**\r\n\r\nWe came up with reasons why the app would benefit all stakeholders:\r\n\r\n- Kids are calmer, engaged, and less stressed.\r\n- Parents feel reassured, supported, and well-informed.\r\n- Emergency Room Staff can focus more on clinical care.\r\n- Reduced Emergency Room traffic due to self-diagnostic features.\r\n- Increased system efficiencies due to integration with provincial systems.\r\n- Overall better healthcare experience for all stakeholders.\r\n\r\nAs the Technical Lead of the team, I began developing a mobile app that combined all of these ideas together.\r\n\r\n# Prototyping\r\n\r\n![IWKids Thumbnail](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/iwkids-thumbnail.webp)\r\n\r\nI decided on creating a [React Native](https://reactnative.dev/) (a tool for creating mobile apps for iOS and Android) app powered by [Expo](https://expo.dev/) (a tool that eases the process of creating mobile apps). For integrating an AI chatbot in the app, I used [OpenAI's](https://openai.com/) APIs (a platform for creating AI-powered applications) to power a medical diagnostic platform capable of providing preliminary diagnoses, as well as [Twilio](https://www.twilio.com/) (a platform for sending SMS messages and notifications) to enable the transmission of SMS text messages for communication and notifications to families.\r\n\r\nWhen approaching the overall design of the app, I made sure it was consistent with the IWK brand. IWK has a [branding guide](https://www.iwk.nshealth.ca/logo/logo-files/IWK-Brand-Identity-Guide-2020-v15.pdf), which I used to find their typography, colors, logo, and used them throughout the app.\r\n\r\n![IWKids Home Screen](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/iwkids-home-screen.webp)\r\n\r\nI designed a simple home page with a column of buttons leading to other sections of the app, keeping navigation straightforward for a critical system like this.\r\n\r\nThe chatbot was one of the most essential screens on the app, as it pre-diagnosed potential patients before they stepped inside the hospital. If the chatbot believes that your condition was serious, it would advise you to check into IWK. The AI model was programmed with this prompt:\r\n\r\n\"_ChatGPT should act like a medical assistant in a children's hospital. It should talk in a friendly, comforting tone and keep responses brief. It should diagnose medical conditions and determine and recommend if people need to go to the Emergency Room or explore other options._\"\r\n\r\nThis prompt allowed the chatbot to approach patients' issues with the right attitude and tone, especially in dire situations that cause stress and anxiety. In the real-world, we theorized that a medical AI model that is vetted by the IWK Hospital would be used instead of a standard ChatGPT model.\r\n\r\nI worked on the check-in mechanism, where you provide your name and phone number and are immediately put into a queue. Your place in the queue would be communicated to your phone number via SMS transmission. After checking in, users could view hospital wait times, which would be connected to hospital databases in a production environment.\r\n\r\nI developed a feedback mechanism after a patient's consultation finishes, where they simply provide a smiley or frowny face along with a description.\r\n\r\nOther smaller features included games for children, quick links to useful resources, and a map of IWK.\r\n\r\nIf you're interested in exploring the code behind IWKids, we've made the project available on [GitHub](https://github.com/soodaayush/IWKids). Feel free to check it out!\r\n\r\nThe flowchart below describes the simplified Emergency Room journey of a patient:\r\n\r\n![ER Journey](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/er-journey.webp)\r\n\r\nAlong with the prototype, we developed a slideshow outlining our pitch, making us ready for the big day that lay ahead.\r\n\r\n# Competition Day\r\n\r\n![Sobey School of Business](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/sobey-school-of-business.webp)\r\n\r\nThe big day arrived, and we were all ready to enter the halls of the Sobey School of Business, where we were promptly registered.\r\n\r\nWhen we entered the lecture hall, we saw about 20 other teams; clearly, many students around Halifax were passionate about tackling the same challenges.\r\n\r\nWe started the morning with snacks and presentations on how AI can be used to push false narratives, biases in AI, and how AI can be used to make our lives easier through various tools such as:\r\n\r\n- [Krea](https://www.krea.ai/) - uses AI to generate and edit images, videos, and animations.\r\n- [Perplexity Pages](https://www.perplexity.ai/hub/blog/perplexity-pages) - lets users transform research and search results into structured, visually-rich articles and reports.\r\n- [Cursor IDE](https://cursor.com/) - an AI-powered code editor.\r\n\r\nThe organizers initiated an activity where we were to form larger groups and describe a positive usage of AI. Each group is to pitch to organizers and their fellow peers, serving as a warm-up to the eventual competition.\r\n\r\n![Positive AI Usage Pitch](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/positive-ai-usage-pitch.webp)\r\n\r\nOur group presented an AI news reporter that will keep tabs on world events 24/7.\r\n\r\nFollowing the informative presentations, we were given some time to iterate on our prototypes and pitches.\r\n\r\n![Team Iterating Pitch](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-iterating-pitch.webp)\r\n\r\nThe structure of the competition was explained to us:\r\n\r\n- There are qualifying rounds, where 3-4 teams are sent to rooms around the building to pitch their ideas for a maximum of five minutes to SMU professors.\r\n- Eight teams who qualified will be sent to the conference room to pitch their ideas in front of a panel of judges along with an audience consisting of families and professionals.\r\n- The top 3 teams win a cash prize.\r\n\r\nAt lunch, we visited sponsor booths and spoke with companies such as [CGI](https://www.cgi.com/canada/), [Ernst & Young](https://www.ey.com/), and representatives from SMU about their visions for AI.\r\n\r\nAs our team was escorted our room, we immediately started adding features to our app and refining our pitch. Teams were provided advisors, mostly SMU Business students, who would make recommendation on what to include/exclude from our prototypes and pitches. The advisors were very impressed with our product and pitch and were anticipating a potential podium finish.\r\n\r\nDuring the hour, I quickly built a Tic-tac-toe game to demonstrate how children's games could be integrated into the app.\r\n\r\nWe planned our pitch to be 2 minutes of explaining the problems in the Emergency Room, covered by Baruch, Yaya, and Seth, following up with me leading a demo of the mobile app.\r\n\r\n![Team Presenting Qualifying Pitch](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/qualifier-pitching.webp)\r\n\r\nWe commenced our qualifying pitch for IWKids, and I thought at the time that we did well despite many areas for improvement. The judges were very impressed with the Tic-tac-toe game I hastily put together in a matter of 20 minutes.\r\n\r\nWe watched the other teams pitch their ambitious ideas, and we didn't know if we would qualify. Following the presentations, all teams were sent to the conference room, where the organizers would announce the teams that would advance forward to present their ideas to the judges.\r\n\r\n![Team Sitting](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-sitting.webp)\r\n\r\nWhile sitting, we were eagerly awaiting the results. After some 30 minutes of silence, the organizers began to read the teams who succeeded from each room.\r\n\r\nWe heard our team's name and immediately began celebrating. We weren't done yet, but we were one more step closer to potentially placing well at this competition.\r\n\r\nThe competition officially began, and we were the third team to present.\r\n\r\nIt was our turn to pitch our idea, and we walked onto the stage in front of a panel of judges and a large audience. We were all nervous being up there, but we believed in our idea and product, which eased our fears.\r\n\r\n![Team Pitching](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-pitching.webp)\r\n\r\nSimilar to the qualifying round, Baruch, Seth, and Yaya explained the problems we were tackling and how our app helps all stakeholders, following up with me demoing the mobile app.\r\n\r\n![Team Demo](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-demo.webp)\r\n\r\nDuring my demo, I emphasized the chatbot along with our SMS integration. To make the judges extremely aware of SMS, we placed a phone at the table in front of them, and thankfully, our demo worked as the device successfully received its message. At the end, we all felt pretty good about the presentation.\r\n\r\nThe other teams finished presenting, and we waited anxiously for the results. We were told to hold back for some time as the judges would deliberate on the winners.\r\n\r\nOur team decided to discuss with other groups regarding their performances and products, as every single group proposed very creative ideas that can genuinely benefit the lives of people in our communities.\r\n\r\nWe were then asked to be seated as the judges were about to unveil the winners of this competition.\r\n\r\nThe judges acknowledged that all pitches were excellent and innovative, making it a hard decision for them to decide the top three winners.\r\n\r\nThey began to announce winners. Third place was announced and it wasn't our group, we were confused as to if this was a positive or negative sign. They announced second place, which was a mobile app that aimed to ease the Emergency Room experience for both patients and IWK staff, and we knew then that we had [achieved](https://www.instagram.com/p/DJNVjHVSZC3/) second place.\r\n\r\nOur group name was announced, and we were all ecstatic to earn our second podium finish in just a month, right after CYBERQUEST, and we won a $500 cheque and a certificate!\r\n\r\n![Team Holding Cheque](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-holding-cheque.webp)\r\n\r\nThere was a ceremony for the winners, where we were all on the stage holding our cheques and getting our photos taken. We were very thrilled to have earned this distinction, as we poured several hours into planning, prototyping, and executing our pitches.\r\n\r\n# Future Possibilities\r\n\r\n![Future Possibilities](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/future-possibilities.webp)\r\n\r\nThere were several features we had in mind regarding the future of this app, ranging from small quality-of-life features such as live wait times to larger integrations such as Digital Twins. I'll discuss a couple of the main features we wanted to see.\r\n\r\nA [digital twin](https://en.wikipedia.org/wiki/Digital_twin) is the most interesting out of the seven features. It essentially is a virtual copy of a real object, system, or process that mirrors its behavior, allowing you to monitor, test, and improve it safely in a digital space. In this context, the digital twin would be the interior and exterior of the IWK Hospital, which can allow staff to improve processes.\r\n\r\nHealth Tracking is another feature that has been implemented in other apps, but would be different with IWKids. [Nova Scotia Health](https://www.nshealth.ca/) is currently working on [One Person One Record (OPOR)](https://physicians.nshealth.ca/topics/nova-scotia-provider-digital-health-toolkit/one-person-one-record-opor), a digital health system that brings all patient information into all unified record, helping providers deliver safer, faster, and more coordinated care. An integration of OPOR with IWKids would be revolutionary as health data in Nova Scotia is mostly kept on paper.\r\n\r\n# Takeaways & Impact\r\n\r\n![Team Photo](/assets/blog/atlantic-canada-ai-summit-youth-ai-pitch/team-photo.webp)\r\n\r\nThis was our first pitch competition, and it taught me a lot about presenting ideas clearly and working collaboratively under pressure. I gained creative problem-solving skills and learned how to clearly present technical ideas to a broader audience.\r\n\r\nThe experience also made AI tangible. Instead of seeing it as abstract algorithms behind the scenes, I saw how it can be applied to solve real problems in our community. Working with my team, we brainstormed, prototyped, and turned an idea into a project we were truly proud of.\r\n\r\nThis project wasn't just a school assignment, it showed me how AI, technology, and teamwork can create real impact. It also proved you don't need to be an expert; curiosity, collaboration, and asking the right questions are enough to make a difference.\r\n\r\nThe competition may be running again next year, and I hope to see Tech Club compete to further contribute to our community! Looking ahead, I'm eager to keep seeking challenges where we push ourselves, learn new skills, and use technology to make a difference.\r\n"
  },
  {
    "slug": "lockheed-martin-cyberquest-2025",
    "meta": {
      "title": "Bay View High at CYBERQUEST 2025: Lessons in Cybersecurity and Teamwork",
      "description": "My experiences in preparing and competing at the Lockheed Martin CYBERQUEST Competition alongside the Bay View High School Tech Club!",
      "date": "August 23, 2025",
      "keywords": [
        "Aayush Sood",
        "Lockheed Martin CyberQuest",
        "Cybersecurity competition",
        "High school CTF",
        "Student cybersecurity challenge",
        "Bay View High School Tech Club"
      ]
    },
    "content": "\r\n![Lockheed Martin Logo](/assets/blog/lockheed-martin-cyberquest-competition-2025/lockheed-martin-logo.webp)\r\n\r\nWhen our [Tech Club](https://bvh-tech-club.netlify.app/) first heard about a chance to compete in a real cybersecurity competition, we never imagined ourselves racing against other schools in a high-stakes hacking challenge. The [Lockheed Martin CYBERQUEST Competition](https://www.lockheedmartin.com/en-us/who-we-are/communities/cyber-quest.html), held in-person across Canada, the U.S., and Australia, is an annual cybersecurity event for high school students. The nearest Lockheed Martin office from our school was just a short distance away in Dartmouth, Nova Scotia.\r\n\r\nThe competition consisted of Capture the Flag (CTF) challenges, which are exercises that involve finding a specific text string within a given problem. For example, a problem may involve investigating a website's source code to find a specific string, such as Y0U_F01ND_M3. Teams that gain the most points out of solving multiple of these challenges in the three-hour competition win 1st place, while others place in the top 3.\r\n\r\nEach high school team consisted of 3-5 members, so we decided on bringing four other passionate Tech Club members and myself to this competition. Categories of challenges spanned from web-based attacks, Cryptography, Social Engineering, and more. Our team was not fully aware of these concepts, so we spent the next few weeks preparing for the competition, which will be hosted in the Dartmouth office on March 29, 2025. We registered our team as Bay View High School SharkBytes.\r\n\r\nWe knew we had a lot to learn before the big day, so we dove into weeks of preparation.\r\n\r\n# Preparation\r\n\r\n![PicoCTF](/assets/blog/lockheed-martin-cyberquest-competition-2025/picoctf.webp)\r\n\r\nOur team wasn't quite sure how to prepare for such an event, especially when it was our first time learning about the broad field of cybersecurity. We eventually stumbled on a platform that prepares you for CTF competitions, called [PicoCTF](https://picoctf.org/). PicoCTF offered problems of varied difficulty and a broad selection of categories, which was perfect for preparing for the competition.\r\n\r\nOur team tried to solve one challenge a day leading up to the competition. We made it an essential objective to especially focus on problems that involve technical areas that we were unfamiliar with, so we can expand our skillsets while focusing less on what we already knew.\r\n\r\nI led a [workshop](https://www.instagram.com/p/DGKInY3se8Y/) for all Tech Club members on PicoCTF and how CTF challenges work, as I found it to be the perfect time to introduce cybersecurity as a career possibility for all Tech Club members.\r\n\r\n![Tech Club Cybersecurity Workshop](/assets/blog/lockheed-martin-cyberquest-competition-2025/cybersecurity-workshop.webp)\r\n\r\nWant to see more of our club's activities, projects, and updates? Follow us on Instagram at [@bvhstechclub](https://www.instagram.com/bvhstechclub/) to stay connected and support our cause!\r\n\r\n# Competition day\r\n\r\n![Lockheed Martin Dartmouth](/assets/blog/lockheed-martin-cyberquest-competition-2025/lockheed-martin-dartmouth.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-Mk4M2BC/A)_\r\n\r\nThe day of the competition rolled around, and we were all excited to enter the office of Lockheed Martin and learn the art of cybersecurity. We entered an area of the building and encountered other teams there from high schools around Halifax. The rules of the competition were explained to us. Here's a quick summary:\r\n\r\n- Challenges ranged in difficulty and point value.\r\n- Teams could spend points for hints.\r\n- Web usage was allowed, except for posting on forums to find answers.\r\n- Generative AI was also allowed, but copying and pasting the challenge prompt into the AI was not allowed.\r\n\r\nThe competition commenced and we got straight to cracking the various cybersecurity problems presented to us.\r\n\r\n![SharkBytes in Competition](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-competing.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-4RZPmtN/A)_\r\n\r\nWe tackled problems concerning Forensics, General Trivia Questions, Operating Systems, and more. Our team worked well, as each of us tackled a separate problem in an effort to gain the most points possible. We decided to tackle the easier, low-point problems first to accumulate points quickly, then moved on to the harder problems. I personally tackled packet analysis through Wireshark, phishing, and web-based problems.\r\n\r\nIt was very competitive, as all three teams were at one point leading one another, but only ever so slightly. There were moments when just one problem made the difference between first and third place. At one point, all five of us came together to tackle a set of tricky trivia questions. We struggled at first, but the solution only emerged after everyone threw in their ideas. That moment was a reminder that the best breakthroughs come from teamwork, not individual effort. The competition felt tense yet very friendly, with all the participants typing away at their computers.\r\n\r\nAfter a very close competition, our team was thrilled to earn third place. We celebrated our achievement with a pizza party, proudly received medals and a trophy, and enjoyed the moment together.\r\n\r\n![SharkBytes Team Picture](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-team-picture.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-bv83stV/A)_\r\n\r\n# Takeaways\r\n\r\nThis competition taught us a variety of tools and techniques. We learned tools such as\r\n\r\n- [Wireshark](https://www.wireshark.org/) - lets you see and analyze the data moving across a network.\r\n- [Burp Suite](https://portswigger.net/burp) - A toolkit for finding security flaws in websites.\r\n- [CyberChef](https://gchq.github.io/CyberChef/) - nicknamed the \"cyber Swiss Army knife,\" it helps decode and transform encrypted text or data.\r\n- [Metasploit](https://www.metasploit.com/) - A framework for safely testing vulnerabilities in systems to understand how attackers might break in.\r\n- [Kali Linux](https://www.kali.org/) - A special operating system loaded with cybersecurity tools used by professionals.\r\n\r\nDue to this being our first team competition, I learned many soft skills, such as leadership, communication, and delegating tasks to my team in real time during a contentious competition such as this.\r\n\r\n# Impact and What's Next\r\n\r\n![SharkBytes Team Picture](/assets/blog/lockheed-martin-cyberquest-competition-2025/sharkbytes-posing.webp)\r\n\r\n_Image credit: Lockheed Martin, 2025. Accessed via [Lockheed Martin](https://lockheedmartin.smugmug.com/CYBERQUEST/n-rM6PBd/Cyberquest-2025/CA-Dartmouth-NS/i-5BpxkLB/A)_\r\n\r\nThis experience reshaped how I see cybersecurity. Before CyberQuest, I thought of it as a niche field for experts. Now, I realize it touches everything, from protecting personal data on social media to safeguarding national infrastructure.\r\n\r\nWith businesses, governments, and even schools relying so heavily on technology, the need for cybersecurity professionals is only going to grow.\r\n\r\nFor me, what started as a school competition has now sparked a genuine interest in a career path that impacts almost every part of modern life.\r\n\r\nIf you've ever been curious about cybersecurity, even if it seems intimidating, dive in. Competitions like CyberQuest prove that with teamwork, creativity, and persistence, anyone can start building these skills. You don't need to be an expert; you just need curiosity and a willingness to learn.\r\n\r\nFor us, what began as a club project turned into an unforgettable experience, and possibly even a career path. Who knows? You first challenge might spark the same for you.\r\n\r\nLooking ahead, I'm excited to continue this journey with my team as we set our sights on the [CyberPatriot National Youth Cyber Defense Competition](https://www.uscyberpatriot.org/), another incredible opportunity to put our skills to the test and grow together as cybersecurity defenders!\r\n"
  },
  {
    "slug": "new-website",
    "meta": {
      "title": "New Website!",
      "description": "This is my first ever blog post! I will be going into the new website, why I built it, the tech stacked used, updates, additions, and the trials and tribulations faced along the journey!",
      "date": "March 15, 2025",
      "keywords": [
        "Aayush Sood"
      ]
    },
    "content": "\r\n![New Website](/assets/blog/new-website/new-website.webp)\r\n\r\nHello World! This may seem new to you, but I now have a website that represents who I am and my interests in an organized manner. I will be going into why I decided to make an entirely new website from scratch, what tools I used, updates & additions, and the trials and tribulations faced during the journey.\r\n\r\n# The Old Website\r\n\r\n![Old Website](/assets/blog/new-website/old-website.webp)\r\n\r\nI had developed the [first iteration](https://portfolio-website-4v4.pages.dev/) of my personal portfolio during the winter break of 2023. It served as a good showcase of my skills and projects at the time, but I had felt that the interface was not as appealing, and that there could have been more information present. I was thinking of updating the original website itself, but found that since I had developed it in basic HTML, CSS, and JavaScript, that it would become tedious to implement complex features such as a blog. I had decided on creating a new website that uses an actual frontend framework to simplify the process of building and adding onto it.\r\n\r\n# Tech Stack\r\n\r\n![Projects Section](/assets/blog/new-website/tech-stack.webp)\r\n\r\nFor this website, I had decided to use the [Next.js](https://nextjs.org/) framework, which is powered by [React.js](https://react.dev/). I had decided on choosing Next.js due to its widely known performance metrics and its SEO optimizations. For all animations on this website, the [Motion](https://motion.dev/) package was used as it provided a simple and seamless experience when creating them. The [React-Icons](https://react-icons.github.io/react-icons/) package was used in a few places on this website, mainly in the Interests section on the Home page and the mobile header. [MDX](https://mdxjs.com/) was used to make it easier for me to write blogs as I was already familiar with Markdown. I use [Cloudflare](https://www.cloudflare.com/) to host this website, as it provides real-time analytics along with DDoS protection.\r\n\r\n# Updates\r\n\r\nMost of the updates made on this new iteration mostly concern the home page. I reworked the entire projects section to be a carousel that is guided by you, the user. This way, the section does not take up as much space as the first iteration did, which is essential when adding more projects to the list.\r\n\r\n![Projects Section](/assets/blog/new-website/projects.webp)\r\n\r\nThe interests section also was reworked, as I found the first iteration of the section to be irrelevant, as it offered no more information about myself. Now, there is a paragraph under each interest explaining why I chose it along with some creators I follow that specialize under that interest.\r\n\r\n![Projects Section](/assets/blog/new-website/interests.webp)\r\n\r\n# Additions\r\n\r\nThere were many new additions to the website, which were mostly new pages. In an effort to further make this website personal to me, I added three pages: The blog, my reading list, and my resume. I had decided on integrating a blog onto this website as I desired a creative outlet for writing about certain items of interest and to also just improve my writing skills in general. I plan to write generally about my life, events that are occurring in the field of technology, and other general topics I feel like writing about. As of right now, there is only one blog post (this one!), but there will be more to arrive in the near future. The reading list section lists all books I have read so far. I wanted to add this piece to the new iteration as a place to showcase my growth and to connect with like-minded people through reading. I added a resume page as I want to showcase my achievements and projects along with providing an outlet for employers to view it. My resume was originally built in HTML and CSS, but I had decided to recreate in LaTeX using [Overleaf](https://www.overleaf.com/), as it produces high-quality professional documents with organized structure. Also, I just learned it because learning new languages is something every programmer should strive to do.\r\n\r\n# Trials & Tribulations\r\n\r\n![Projects Section](/assets/blog/new-website/edge-runtime.webp)\r\n\r\nUnironically, this blog was the hardest section of the website to implement. Back when the website launched around January 2025, I already had a fully working solution for this blog. But there was just one problem. Remember when I told you that this website was hosted on Cloudflare? It turns out Cloudflare runs website on something called the Edge Runtime. Edge is an alternative to traditional Node.js runtime, designed for lower latency and better performance. Since this website was created using Node.js, the blog was utilized to use Node.js packages such as `fn` and `path`. Since those two packages, which simplified the blogging process, were not allowed, I had to find a different method of displaying blogs. I eventually found a method to quell this roadblock by generating a JSON file containing each blog post (in the form of a MDX file), and fetching that JSON file to render each post.\r\n\r\n# Conclusion\r\n\r\nThis should be the first of many blog posts to arrive on this website so stay tuned! If you made it to the end of the post, thank you for your time and I look forward to sharing more exciting content with you in the future.\r\n"
  },
  {
    "slug": "shad-unb-2025",
    "meta": {
      "title": "Shad UNB 2025",
      "description": "My experiences with Shad Canada and how it was the longest shortest summer!",
      "date": "January 1, 2026",
      "keywords": [
        "Aayush Sood"
      ]
    },
    "content": "\r\n![University of New Brunswick](/assets/blog/shad-unb-2025/UNB.jpg)\r\n\r\n_Image credit: [Cameron Chung](https://www.instagram.com/cameron.h.c.photography/)_\r\n\r\nIn the summer of 2025, I attended [Shad](https://www.shad.ca/) at the [University of New Brunswick](https://unb.ca/), a STEAM and entrepreneurship program for Canadian high school students in grades 10–11. On paper, the description sounds very generic; almost interchangeable with dozens of other summer programs. But in reality, SHAD was anything but. It was a month defined by late nights, unfamiliar challenges, constant learning, and a community of people who pushed me to think harder, work faster, and believe more confidently in my own ideas. It was, quite literally, one of the most unforgettable months of my life.\r\n\r\n# What is Shad?\r\n\r\n![Joy Kidd](/assets/blog/shad-unb-2025/joy-kidd.jpg)\r\n\r\n_Image credit: [Cameron Chung](https://www.instagram.com/cameron.h.c.photography/)_\r\n\r\nShad is a month-long STEAM and entrepreneurship program for Canadian high school students that runs on university campuses across the country. Fundamentally, Shad is about bringing together curious, motivated students and pushing them outside their comfort zones through hands-on problem solving and collaboration.\r\n\r\nThroughout the program, students work in teams to tackle real-world design challenges, attend lectures and workshops led by professors and industry professionals, and develop ideas under tight timelines. Days are long and fast-paced, often blending technical work, creative thinking, and presentation skills into a single project.\r\n\r\nWhat makes Shad different from a typical summer program is its intensity and community. You are constantly surrounded by people who are as driven and curious as you are, which creates an environment where learning happens rapidly; and where you quickly realize how much more capable you are than you initially thought.\r\n\r\n# This sounds fun... How do I Participate?\r\n\r\n![Whale Watching](/assets/blog/shad-unb-2025/whale-watching.jpg)\r\n\r\n_Image credit: [Cameron Chung](https://www.instagram.com/cameron.h.c.photography/)_\r\n\r\nIf this sort of thing excites you; there is an application process that can be found on Shad's [website](https://www.shad.ca/). The application typically opens around September and closes in January (this is as of the Shad 2026 application cycle).\r\n\r\nThe application consists of basic information about yourself, essay questions about your experiences, and your academics. The application is not lengthy, but it requires you to think through your motivations for attending the program as well as the life experiences that made you who you are today. I found that completing this application last year definitely prepared me for a similar structure in university applications as well. I typically receive many questions regarding the essays and academics in particular, so lets break that down.\r\n\r\nIn terms of essay questions, Shad is not looking for applicants to have cured all infectious diseases in the world by the time they're 15. They are simply looking for individuals who are curious about the world around them and who are also driven, creative, and community-driven. All of these elements can be demonstrated in a multitude of methods: whether it be being an executive of a club at your school, being an actor on a theatrical production, volunteering at youth summer camps, or many more. The advice I have to offer in this regard is to really tie your experiences to the essay questions; that way, Shad understands how your experiences have shaped your personality and who you are today as a result of it.\r\n\r\nIn regard to academics, you are required to upload a report card containing your grades for the last academic year. Shad is not strict with high grade requirements; they just want to see if you are academically ready for the program. In my opinion, the academics are not as important as the personality you show in your essays, so I would recommend focusing on your story rather than your grades.\r\n\r\nAfter being accepted to the program, you present your top choices for university placements and Shad will try their best to place you in your top universities.\r\n\r\nFor me, I was placed at the University of New Brunswick in Fredericton, New Brunswick from June 29 - July 25. New Brunswick was not too far from my hometown, Halifax, Nova Scotia, so it was an easy commute compared to others' experiences.\r\n\r\n# First Week\r\n\r\n![Whale Watching](/assets/blog/shad-unb-2025/room.jpg)\r\n\r\n_A picture of my room for the month_\r\n\r\nI do not really remember the first week of Shad as much as the rest, as it was mostly awkward conversations about what your name was and where you were from. Although, it is worth mentioning as I find it to be the period that can influence the degree to which you enjoy your time during the program.\r\n\r\nMy Shad campus in particular had 52 Shads (the participants) along with Program Assistants (PAs) and Program Directors (PDs). PDs coordinate the activities each day while PAs help the PDs in facilitating the undertakings. As a Shad, you will spend significantly more time with your PAs than your PDs.\r\n\r\nMost of my fellow Shads were far from home, with most of them flying into Fredericton. A large minority of the group of 52 were from Ontario, particularly in the Greater Toronto area; but there were pockets of people from the Prairies and even Atlantic Canada.\r\n\r\nMost of the week was spent participating in team-building activities and games, which were designed for us to connect with one another at a deeper level.\r\n\r\n![Paper Tower Challenge](/assets/blog/shad-unb-2025/paper-tower-challenge.jpg)\r\n\r\n_An activity where groups were tasked to build the tallest paper tower_\r\n\r\nPart of the experience at Shad is crafting your very own meals in a hopefully classy manners (cannot speak for everyone) at the mess hall. If you want insight into the sort of meals crafted at Shad UNB, please take the time to peruse the Shad UNB Food Reviews [Instagram](https://www.instagram.com/shadunb_foodreviews_25/) account!\r\n\r\n![Food](/assets/blog/shad-unb-2025/food.jpg)\r\n\r\n_Delicious Food_\r\n\r\nWe were also introduced to the Design & Entrepreneurship (DE) project, a month-long, team-based challenge where students work together to tackle some of the most complex problems facing Canadian society. The project emphasizes human-centred design, iteration, and entrepreneurship, pushing teams to move from broad problem spaces to tangible, well-justified solutions under tight timelines. Each year, all SHAD campuses work on the same overarching challenge, allowing ideas to emerge from a shared national problem. For SHAD 2025, the problem statement was: How might we design innovative and sustainable transportation solutions that meet the needs of people in Canada? More on that later.\r\n\r\n# Trips\r\n\r\n![Camping](/assets/blog/shad-unb-2025/camping.jpg)\r\n\r\nPart of the experience of Shad is embarking on trips around your university. \r\n\r\nOn our first trip we visited the [Point Lepreau Nuclear Generating Station](https://www.cnsc-ccsn.gc.ca/eng/reactors/power-plants/point-lepreau-nuclear-generating-station/), the only one in Atlantic Canada. Unfortunately, we were not allowed to take photos, but I learned about how nuclear power plants operate and the security measures required in order to protect it. These trips are scheduled in advance so that we are able to have the privilege to visit these otherwise inaccessible sites.\r\n\r\nOur second trip we visited [Mactaquac Provincial Park](https://www.parcsnbparks.ca/en/parks/10/mactaquac-provincial-park) to go camping. One trip that is almost consistent with all Shad campuses is camping, so I would definitely recommend bringing all of your treasured camping supplies (including powerbanks!). \r\n\r\n![Campfire](/assets/blog/shad-unb-2025/campfire.jpg)\r\n\r\nThis was my first time camping and I believe that it could not have been better spent than with a group that quickly felt like a community, where learning and connection happened just as much outside the program as within it.\r\n\r\n![Travelling in Saint John](/assets/blog/shad-unb-2025/saint-john.jpg)\r\n\r\nOn our third trip we travelled south to Saint John, New Brunswick. The goal of the trip was to explore the various markets that surrounded us along with having a tour of the [Port of Saint John](https://www.sjport.com/) from the CEO, Craig Estabrooks. The tour allowed me to learn extensively about the complex process of how ports operate, especially in one of the largest ports in the Atlantic provinces.\r\n\r\n![Huntsman Marine Science Centre](/assets/blog/shad-unb-2025/st-andrews-aquarium.jpg)\r\n\r\nOn our fourth and final trip we visited St. Andrews, New Brunswick, a northern town known for its presence of whales. Our group visited the [Huntsman Marine Science Centre](https://www.huntsmanmarine.ca/aquarium) and conducted a lab where we used microscopes to analyze microorganisms in the sea! One of the most exciting parts of this trip was whale watching, but I unfortunately have no photos of the whales. Although, the journey in the ocean contained some beautiful views.\r\n\r\n![Island](/assets/blog/shad-unb-2025/island.jpg)\r\n\r\nOverall, the trips allowed us to step outside the structure of campus life and experience Shad from a different perspective. They gave us the chance to explore new environments, connect more deeply with one another, and momentarily slow down in the midst of an otherwise fast-paced program. Whether it was learning beyond a classroom, sharing long conversations, or simply being present in unfamiliar settings, the trips strengthened our sense of community and made the experience feel more balanced. They reminded me that some of the most meaningful moments at Shad didn’t come from scheduled activities, but from shared experiences that brought us closer together.\r\n\r\n# Design & Entrepreneurship Project\r\n\r\n![DE Cohort](/assets/blog/shad-unb-2025/de-cohort.jpeg)\r\n\r\nA couple of sections ago I referenced a fun component of Shad called the Design & Entrepreneurship project. Initially, there was not much attention paid towards this activity, but it ramped up during the second and third weeks of the program. All 52 of us were sorted into groups of 4-5 members and were given an overall topic to tackle within the problem statement. \r\n\r\nThe general topic we were given was surrounding the social stigma of using public transportation. This was an issue I had already been familiar with, as public transportation in Halifax had always been viewed as undesirable due to various factors. Our group was not sure about what social issue to tackle, so we asked Canadians across the country using a simple survey. \r\n\r\nIn the data, we examined several issues: lack of access to buses, infrequent arrivals for public buses, and a lack of hygiene within buses. Our group decided on tackling hygiene, meaning that we were going to develop a solution that improved hygiene in buses in Halifax.\r\n\r\n![Business Model Canvas](/assets/blog/shad-unb-2025/business-model-canvas.jpg)\r\n\r\nAfter understanding the issue we needed to solve, we had to develop a [Business Model Canvas](https://en.wikipedia.org/wiki/Business_model_canvas). A Business Model Canvas is essentially a way to think through whether an idea could exist in the real world. Instead of focusing only on the solution itself, it forces you to consider who the idea is for, what problem it solves, and how it could realistically be implemented and sustained. At Shad, we used it to move beyond just having an interesting concept and start thinking about practicality; costs, partnerships, and how people would actually interact with what we were designing. It helped turn abstract ideas into something more grounded and intentional.\r\n\r\nAfter crafting our business model, we established our company, HyRide. HyRide is a public transit hygiene solution designed to make buses cleaner, more reliable, and more appealing to riders. The company installs an efficient disinfectant misting system on buses that sanitizes interiors in under a minute between routes and performs deeper overnight cleaning, reducing delays caused by manual cleaning while improving overall cleanliness. By pairing this system with added hygiene features (such as trash bins and hand sanitizer dispensers) and a strong public-facing marketing campaign, HyRide aims to change public perception of buses from unhygienic to a smart, safe, and convenient transportation choice. Ultimately, HyRide helps transit agencies increase ridership, reduce delays, and rebuild trust in public transit.\r\n"
  }
]