[
  {
    "name": "Gaming",
    "icon": "FaGamepad",
    "description": "I love immersing myself in diverse virtual worlds, exploring narratives, and tackling challenges. Gaming isn't just about entertainment; it's a gateway to experiencing different cultures, stories, and perspectives. It sharpens my reflexes, strategic thinking, and teamwork skills, all while providing a sense of community through multiplayer experiences and online forums. The evolving nature of gaming technology also fascinates me, from realistic graphics to the rise of virtual and augmented reality, making it a field that constantly piques my interest.",
    "channels": [
      {
        "name": "CoryxKenshin",
        "link": "https://www.youtube.com/@CoryxKenshin"
      },
      {
        "name": "videogamedunkey",
        "link": "https://www.youtube.com/@videogamedunkey"
      }
    ]
  },
  {
    "name": "Math",
    "icon": "PiMathOperationsFill",
    "description": "Math fuels my logical reasoning and analytical skills. I enjoy delving into mathematical puzzles, exploring abstract concepts, and applying them to real-world problems. Whether it's algebra, calculus, or statistics, each area of mathematics offers unique insights into the workings of the universe, enhancing my ability to think critically and solve problems efficiently.",
    "channels": [
      {
        "name": "3Blue1Brown",
        "link": "https://www.youtube.com/@3blue1brown"
      },
      {
        "name": "Numberphile",
        "link": "https://www.youtube.com/@numberphile"
      },
      {
        "name": "Krista King",
        "link": "https://www.kristakingmath.com/"
      },
      {
        "name": "Khan Academy",
        "link": "https://www.khanacademy.org"
      }
    ]
  },
  {
    "name": "Science",
    "icon": "MdScience",
    "description": "Science is a vast domain that captures my curiosity with its exploration of the natural world. Physics, in particular, offers a profound understanding of the universe, from the smallest particles to the largest cosmic structures. I am captivated by concepts like relativity, quantum mechanics, and thermodynamics. Science, in general, drives innovation and shapes our future, making it an essential part of our progress. I enjoy staying updated with the latest scientific discoveries and exploring how they can be applied to improve our lives.",
    "channels": [
      {
        "name": "Veritasium",
        "link": "https://www.youtube.com/@veritasium"
      },
      {
        "name": "Mark Rober",
        "link": "https://www.youtube.com/@MarkRober"
      },
      {
        "name": "Vsauce",
        "link": "https://www.youtube.com/@Vsauce"
      },
      {
        "name": "Jeremy Krug",
        "link": "https://www.youtube.com/@JeremyKrug"
      },
      {
        "name": "The Organic Chemistry Tutor",
        "link": "https://www.youtube.com/@TheOrganicChemistryTutor"
      },
      {
        "name": "TED-Ed",
        "link": "https://www.youtube.com/@TEDEd"
      }
    ]
  },
  {
    "name": "Geopolitics",
    "icon": "FaGlobe",
    "description": "Geopolitics is a fascinating field that delves into the complexities of international relations, power structures, and global conflicts. Understanding the historical context of geopolitical events helps me analyze current affairs more critically. I am particularly interested in how economic policies, cultural exchanges, and technological advancements influence the global stage. This interest allows me to connect the dots between different events and understand their broader implications.",
    "channels": [
      {
        "name": "Peter Zeihan",
        "link": "https://www.youtube.com/@ZeihanonGeopolitics"
      },
      {
        "name": "CaspianReport",
        "link": "https://www.youtube.com/@CaspianReport"
      },
      {
        "name": "RealLifeLore",
        "link": "https://www.youtube.com/@RealLifeLore"
      },
      {
        "name": "Search Party",
        "link": "https://www.youtube.com/@SearchParty"
      }
    ]
  },
  {
    "name": "MMA",
    "icon": "MdOutlineSportsMartialArts",
    "description": "Mixed Martial Arts challenge my physical and mental limits. The sport demands discipline, strategy, and resilience. Training in MMA has taught me the importance of focus, adaptability, and respect for opponents. Beyond the physical benefits, it provides a sense of accomplishment and boosts my confidence. Watching professional fights also offers valuable insights into techniques and strategies, fueling my passion for continuous learning and self-improvement.",
    "channels": [
      {
        "name": "UFC",
        "link": "https://www.youtube.com/@ufc"
      },
      {
        "name": "Khabib Nurmagomedov",
        "link": "https://www.youtube.com/@KhabibTheEagle"
      },
      {
        "name": "Alex Pereira",
        "link": "https://www.youtube.com/@Poatan.AlexPereira"
      },
      {
        "name": "Gordon Ryan",
        "link": "https://www.youtube.com/@Gordonlovesjiujitsu"
      },
      {
        "name": "ONE Championship",
        "link": "https://www.youtube.com/@ONEChampionship"
      },
      {
        "name": "FloGrappling",
        "link": "https://www.youtube.com/@FloGrappling"
      }
    ]
  },
  {
    "name": "Programming",
    "icon": "FaCode",
    "description": "Programming is both a creative outlet and a problem-solving tool for me. It allows me to bring ideas to life by developing software and applications that can make a real difference. I enjoy exploring different programming languages, frameworks, and tools, constantly learning and adapting to new technologies. The process of debugging and optimizing code is particularly rewarding, as it challenges my patience and perseverance. Programming is not just a skill; it's a way of thinking that empowers me to tackle complex problems in innovative ways.",
    "channels": [
      {
        "name": "Fireship",
        "link": "https://www.youtube.com/@Fireship"
      },
      {
        "name": "Gennady Korotkevich",
        "link": "https://www.youtube.com/@que_tourist"
      },
      {
        "name": "Kevin Powell",
        "link": "https://www.youtube.com/@KevinPowell"
      },
      {
        "name": "CS50",
        "link": "https://www.youtube.com/@cs50"
      },
      {
        "name": "Academind",
        "link": "https://www.youtube.com/@academind"
      },
      {
        "name": "Zero To Mastery",
        "link": "https://zerotomastery.io/"
      }
    ]
  },
  {
    "name": "Technology",
    "icon": "FaLaptop",
    "description": "Technology is the backbone of modern society, driving innovation and transformation in every field. My fascination with technology stems from its ability to solve complex problems and improve our quality of life. Whether it's artificial intelligence, blockchain, or renewable energy, I am excited by the possibilities that technology offers. I enjoy staying ahead of the curve, learning about emerging trends, and exploring how they can be harnessed to create a better future.",
    "channels": [
      {
        "name": "Ben Eater",
        "link": "https://www.youtube.com/@BenEater"
      },
      {
        "name": "styropyro",
        "link": "https://www.youtube.com/@styropyro"
      },
      {
        "name": "Branch Education",
        "link": "https://www.youtube.com/@BranchEducation"
      }
    ]
  }
]
